Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa6f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x64295): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x63be7): ../Core/Src/DC_Motor.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x6b948): C:/Users/hp/Desktop/NTI/Auto Parking_Final Update/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x64fcd): signed char
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x8314): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 7 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x6122a): unsigned char
 <1><44>: Abbrev Number: 7 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x63ff7): short int
 <1><4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x6ce5f): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 7 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x43909): short unsigned int
 <1><5e>: Abbrev Number: 7 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x1ad65): long int
 <1><65>: Abbrev Number: 4 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x3b23c): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 7 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4f370): long unsigned int
 <1><78>: Abbrev Number: 7 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x35a2d): long long int
 <1><7f>: Abbrev Number: 7 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x2e0bb): long long unsigned int
 <1><86>: Abbrev Number: 22 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 7 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x48a78): unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x8316): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x8d6ab): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x8d68b): uint32_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <be>   DW_AT_byte_size   : 24
    <bf>   DW_AT_decl_file   : 4
    <c0>   DW_AT_decl_line   : 213
    <c1>   DW_AT_decl_column : 9
    <c1>   DW_AT_sibling     : <0x10d>
 <2><c5>: Abbrev Number: 15 (DW_TAG_member)
    <c6>   DW_AT_name        : CR
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 215
    <ca>   DW_AT_decl_column : 17
    <ca>   DW_AT_type        : <0xb8>
    <ce>   DW_AT_data_member_location: 0
 <2><cf>: Abbrev Number: 2 (DW_TAG_member)
    <d0>   DW_AT_name        : (indirect string, offset: 0x7e867): NDTR
    <d4>   DW_AT_decl_file   : 4
    <d5>   DW_AT_decl_line   : 216
    <d6>   DW_AT_decl_column : 17
    <d7>   DW_AT_type        : <0xb8>
    <db>   DW_AT_data_member_location: 4
 <2><dc>: Abbrev Number: 15 (DW_TAG_member)
    <dd>   DW_AT_name        : PAR
    <e1>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 217
    <e2>   DW_AT_decl_column : 17
    <e2>   DW_AT_type        : <0xb8>
    <e6>   DW_AT_data_member_location: 8
 <2><e7>: Abbrev Number: 2 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0x2dfe): M0AR
    <ec>   DW_AT_decl_file   : 4
    <ed>   DW_AT_decl_line   : 218
    <ee>   DW_AT_decl_column : 17
    <ef>   DW_AT_type        : <0xb8>
    <f3>   DW_AT_data_member_location: 12
 <2><f4>: Abbrev Number: 2 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0x83ba0): M1AR
    <f9>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 219
    <fb>   DW_AT_decl_column : 17
    <fc>   DW_AT_type        : <0xb8>
    <100>   DW_AT_data_member_location: 16
 <2><101>: Abbrev Number: 15 (DW_TAG_member)
    <102>   DW_AT_name        : FCR
    <106>   DW_AT_decl_file   : 4
    <106>   DW_AT_decl_line   : 220
    <107>   DW_AT_decl_column : 17
    <107>   DW_AT_type        : <0xb8>
    <10b>   DW_AT_data_member_location: 20
 <2><10c>: Abbrev Number: 0
 <1><10d>: Abbrev Number: 4 (DW_TAG_typedef)
    <10e>   DW_AT_name        : (indirect string, offset: 0x7c83d): DMA_Stream_TypeDef
    <112>   DW_AT_decl_file   : 4
    <113>   DW_AT_decl_line   : 221
    <114>   DW_AT_decl_column : 3
    <115>   DW_AT_type        : <0xbd>
 <1><119>: Abbrev Number: 19 (DW_TAG_structure_type)
    <11a>   DW_AT_byte_size   : 40
    <11b>   DW_AT_decl_file   : 4
    <11b>   DW_AT_decl_line   : 264
    <11d>   DW_AT_decl_column : 9
    <11d>   DW_AT_sibling     : <0x19a>
 <2><121>: Abbrev Number: 1 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x660f2): MODER
    <126>   DW_AT_decl_file   : 4
    <127>   DW_AT_decl_line   : 266
    <129>   DW_AT_decl_column : 17
    <12a>   DW_AT_type        : <0xb8>
    <12e>   DW_AT_data_member_location: 0
 <2><12f>: Abbrev Number: 1 (DW_TAG_member)
    <130>   DW_AT_name        : (indirect string, offset: 0x35f81): OTYPER
    <134>   DW_AT_decl_file   : 4
    <135>   DW_AT_decl_line   : 267
    <137>   DW_AT_decl_column : 17
    <138>   DW_AT_type        : <0xb8>
    <13c>   DW_AT_data_member_location: 4
 <2><13d>: Abbrev Number: 1 (DW_TAG_member)
    <13e>   DW_AT_name        : (indirect string, offset: 0x2b509): OSPEEDR
    <142>   DW_AT_decl_file   : 4
    <143>   DW_AT_decl_line   : 268
    <145>   DW_AT_decl_column : 17
    <146>   DW_AT_type        : <0xb8>
    <14a>   DW_AT_data_member_location: 8
 <2><14b>: Abbrev Number: 1 (DW_TAG_member)
    <14c>   DW_AT_name        : (indirect string, offset: 0x85c38): PUPDR
    <150>   DW_AT_decl_file   : 4
    <151>   DW_AT_decl_line   : 269
    <153>   DW_AT_decl_column : 17
    <154>   DW_AT_type        : <0xb8>
    <158>   DW_AT_data_member_location: 12
 <2><159>: Abbrev Number: 5 (DW_TAG_member)
    <15a>   DW_AT_name        : IDR
    <15e>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 270
    <160>   DW_AT_decl_column : 17
    <160>   DW_AT_type        : <0xb8>
    <164>   DW_AT_data_member_location: 16
 <2><165>: Abbrev Number: 5 (DW_TAG_member)
    <166>   DW_AT_name        : ODR
    <16a>   DW_AT_decl_file   : 4
    <16a>   DW_AT_decl_line   : 271
    <16c>   DW_AT_decl_column : 17
    <16c>   DW_AT_type        : <0xb8>
    <170>   DW_AT_data_member_location: 20
 <2><171>: Abbrev Number: 1 (DW_TAG_member)
    <172>   DW_AT_name        : (indirect string, offset: 0x5f7c0): BSRR
    <176>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 272
    <179>   DW_AT_decl_column : 17
    <17a>   DW_AT_type        : <0xb8>
    <17e>   DW_AT_data_member_location: 24
 <2><17f>: Abbrev Number: 1 (DW_TAG_member)
    <180>   DW_AT_name        : (indirect string, offset: 0x24568): LCKR
    <184>   DW_AT_decl_file   : 4
    <185>   DW_AT_decl_line   : 273
    <187>   DW_AT_decl_column : 17
    <188>   DW_AT_type        : <0xb8>
    <18c>   DW_AT_data_member_location: 28
 <2><18d>: Abbrev Number: 5 (DW_TAG_member)
    <18e>   DW_AT_name        : AFR
    <192>   DW_AT_decl_file   : 4
    <192>   DW_AT_decl_line   : 274
    <194>   DW_AT_decl_column : 17
    <194>   DW_AT_type        : <0x1aa>
    <198>   DW_AT_data_member_location: 32
 <2><199>: Abbrev Number: 0
 <1><19a>: Abbrev Number: 16 (DW_TAG_array_type)
    <19b>   DW_AT_type        : <0xb8>
    <19f>   DW_AT_sibling     : <0x1aa>
 <2><1a3>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1a4>   DW_AT_type        : <0x8d>
    <1a8>   DW_AT_upper_bound : 1
 <2><1a9>: Abbrev Number: 0
 <1><1aa>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <1ab>   DW_AT_type        : <0x19a>
 <1><1af>: Abbrev Number: 10 (DW_TAG_typedef)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x6f26a): GPIO_TypeDef
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 275
    <1b7>   DW_AT_decl_column : 3
    <1b7>   DW_AT_type        : <0x119>
 <1><1bb>: Abbrev Number: 19 (DW_TAG_structure_type)
    <1bc>   DW_AT_byte_size   : 84
    <1bd>   DW_AT_decl_file   : 4
    <1bd>   DW_AT_decl_line   : 469
    <1bf>   DW_AT_decl_column : 9
    <1bf>   DW_AT_sibling     : <0x2d4>
 <2><1c3>: Abbrev Number: 5 (DW_TAG_member)
    <1c4>   DW_AT_name        : CR1
    <1c8>   DW_AT_decl_file   : 4
    <1c8>   DW_AT_decl_line   : 471
    <1ca>   DW_AT_decl_column : 17
    <1ca>   DW_AT_type        : <0xb8>
    <1ce>   DW_AT_data_member_location: 0
 <2><1cf>: Abbrev Number: 5 (DW_TAG_member)
    <1d0>   DW_AT_name        : CR2
    <1d4>   DW_AT_decl_file   : 4
    <1d4>   DW_AT_decl_line   : 472
    <1d6>   DW_AT_decl_column : 17
    <1d6>   DW_AT_type        : <0xb8>
    <1da>   DW_AT_data_member_location: 4
 <2><1db>: Abbrev Number: 1 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x82775): SMCR
    <1e0>   DW_AT_decl_file   : 4
    <1e1>   DW_AT_decl_line   : 473
    <1e3>   DW_AT_decl_column : 17
    <1e4>   DW_AT_type        : <0xb8>
    <1e8>   DW_AT_data_member_location: 8
 <2><1e9>: Abbrev Number: 1 (DW_TAG_member)
    <1ea>   DW_AT_name        : (indirect string, offset: 0x61fc6): DIER
    <1ee>   DW_AT_decl_file   : 4
    <1ef>   DW_AT_decl_line   : 474
    <1f1>   DW_AT_decl_column : 17
    <1f2>   DW_AT_type        : <0xb8>
    <1f6>   DW_AT_data_member_location: 12
 <2><1f7>: Abbrev Number: 5 (DW_TAG_member)
    <1f8>   DW_AT_name        : SR
    <1fb>   DW_AT_decl_file   : 4
    <1fb>   DW_AT_decl_line   : 475
    <1fd>   DW_AT_decl_column : 17
    <1fd>   DW_AT_type        : <0xb8>
    <201>   DW_AT_data_member_location: 16
 <2><202>: Abbrev Number: 5 (DW_TAG_member)
    <203>   DW_AT_name        : EGR
    <207>   DW_AT_decl_file   : 4
    <207>   DW_AT_decl_line   : 476
    <209>   DW_AT_decl_column : 17
    <209>   DW_AT_type        : <0xb8>
    <20d>   DW_AT_data_member_location: 20
 <2><20e>: Abbrev Number: 1 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x56474): CCMR1
    <213>   DW_AT_decl_file   : 4
    <214>   DW_AT_decl_line   : 477
    <216>   DW_AT_decl_column : 17
    <217>   DW_AT_type        : <0xb8>
    <21b>   DW_AT_data_member_location: 24
 <2><21c>: Abbrev Number: 1 (DW_TAG_member)
    <21d>   DW_AT_name        : (indirect string, offset: 0x548a8): CCMR2
    <221>   DW_AT_decl_file   : 4
    <222>   DW_AT_decl_line   : 478
    <224>   DW_AT_decl_column : 17
    <225>   DW_AT_type        : <0xb8>
    <229>   DW_AT_data_member_location: 28
 <2><22a>: Abbrev Number: 1 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0x80be7): CCER
    <22f>   DW_AT_decl_file   : 4
    <230>   DW_AT_decl_line   : 479
    <232>   DW_AT_decl_column : 17
    <233>   DW_AT_type        : <0xb8>
    <237>   DW_AT_data_member_location: 32
 <2><238>: Abbrev Number: 5 (DW_TAG_member)
    <239>   DW_AT_name        : CNT
    <23d>   DW_AT_decl_file   : 4
    <23d>   DW_AT_decl_line   : 480
    <23f>   DW_AT_decl_column : 17
    <23f>   DW_AT_type        : <0xb8>
    <243>   DW_AT_data_member_location: 36
 <2><244>: Abbrev Number: 5 (DW_TAG_member)
    <245>   DW_AT_name        : PSC
    <249>   DW_AT_decl_file   : 4
    <249>   DW_AT_decl_line   : 481
    <24b>   DW_AT_decl_column : 17
    <24b>   DW_AT_type        : <0xb8>
    <24f>   DW_AT_data_member_location: 40
 <2><250>: Abbrev Number: 5 (DW_TAG_member)
    <251>   DW_AT_name        : ARR
    <255>   DW_AT_decl_file   : 4
    <255>   DW_AT_decl_line   : 482
    <257>   DW_AT_decl_column : 17
    <257>   DW_AT_type        : <0xb8>
    <25b>   DW_AT_data_member_location: 44
 <2><25c>: Abbrev Number: 5 (DW_TAG_member)
    <25d>   DW_AT_name        : RCR
    <261>   DW_AT_decl_file   : 4
    <261>   DW_AT_decl_line   : 483
    <263>   DW_AT_decl_column : 17
    <263>   DW_AT_type        : <0xb8>
    <267>   DW_AT_data_member_location: 48
 <2><268>: Abbrev Number: 1 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x6f24e): CCR1
    <26d>   DW_AT_decl_file   : 4
    <26e>   DW_AT_decl_line   : 484
    <270>   DW_AT_decl_column : 17
    <271>   DW_AT_type        : <0xb8>
    <275>   DW_AT_data_member_location: 52
 <2><276>: Abbrev Number: 1 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x39645): CCR2
    <27b>   DW_AT_decl_file   : 4
    <27c>   DW_AT_decl_line   : 485
    <27e>   DW_AT_decl_column : 17
    <27f>   DW_AT_type        : <0xb8>
    <283>   DW_AT_data_member_location: 56
 <2><284>: Abbrev Number: 1 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x35456): CCR3
    <289>   DW_AT_decl_file   : 4
    <28a>   DW_AT_decl_line   : 486
    <28c>   DW_AT_decl_column : 17
    <28d>   DW_AT_type        : <0xb8>
    <291>   DW_AT_data_member_location: 60
 <2><292>: Abbrev Number: 1 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0xf8e0): CCR4
    <297>   DW_AT_decl_file   : 4
    <298>   DW_AT_decl_line   : 487
    <29a>   DW_AT_decl_column : 17
    <29b>   DW_AT_type        : <0xb8>
    <29f>   DW_AT_data_member_location: 64
 <2><2a0>: Abbrev Number: 1 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0xa5c9): BDTR
    <2a5>   DW_AT_decl_file   : 4
    <2a6>   DW_AT_decl_line   : 488
    <2a8>   DW_AT_decl_column : 17
    <2a9>   DW_AT_type        : <0xb8>
    <2ad>   DW_AT_data_member_location: 68
 <2><2ae>: Abbrev Number: 5 (DW_TAG_member)
    <2af>   DW_AT_name        : DCR
    <2b3>   DW_AT_decl_file   : 4
    <2b3>   DW_AT_decl_line   : 489
    <2b5>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xb8>
    <2b9>   DW_AT_data_member_location: 72
 <2><2ba>: Abbrev Number: 1 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x3ddc): DMAR
    <2bf>   DW_AT_decl_file   : 4
    <2c0>   DW_AT_decl_line   : 490
    <2c2>   DW_AT_decl_column : 17
    <2c3>   DW_AT_type        : <0xb8>
    <2c7>   DW_AT_data_member_location: 76
 <2><2c8>: Abbrev Number: 5 (DW_TAG_member)
    <2c9>   DW_AT_name        : OR
    <2cc>   DW_AT_decl_file   : 4
    <2cc>   DW_AT_decl_line   : 491
    <2ce>   DW_AT_decl_column : 17
    <2ce>   DW_AT_type        : <0xb8>
    <2d2>   DW_AT_data_member_location: 80
 <2><2d3>: Abbrev Number: 0
 <1><2d4>: Abbrev Number: 10 (DW_TAG_typedef)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x48f35): TIM_TypeDef
    <2d9>   DW_AT_decl_file   : 4
    <2da>   DW_AT_decl_line   : 492
    <2dc>   DW_AT_decl_column : 3
    <2dc>   DW_AT_type        : <0x1bb>
 <1><2e0>: Abbrev Number: 7 (DW_TAG_base_type)
    <2e1>   DW_AT_byte_size   : 8
    <2e2>   DW_AT_encoding    : 4	(float)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x8e4fd): long double
 <1><2e7>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <2e8>   DW_AT_encoding    : 7	(unsigned)
    <2e8>   DW_AT_byte_size   : 1
    <2e8>   DW_AT_type        : <0x3d>
    <2ec>   DW_AT_decl_file   : 5
    <2ed>   DW_AT_decl_line   : 39
    <2ee>   DW_AT_decl_column : 1
    <2ee>   DW_AT_sibling     : <0x30b>
 <2><2f2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x5b6e7): HAL_OK
    <2f7>   DW_AT_const_value : 0
 <2><2f8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x481fc): HAL_ERROR
    <2fd>   DW_AT_const_value : 1
 <2><2fe>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x590c): HAL_BUSY
    <303>   DW_AT_const_value : 2
 <2><304>: Abbrev Number: 3 (DW_TAG_enumerator)
    <305>   DW_AT_name        : (indirect string, offset: 0x471aa): HAL_TIMEOUT
    <309>   DW_AT_const_value : 3
 <2><30a>: Abbrev Number: 0
 <1><30b>: Abbrev Number: 4 (DW_TAG_typedef)
    <30c>   DW_AT_name        : (indirect string, offset: 0x7f0ae): HAL_StatusTypeDef
    <310>   DW_AT_decl_file   : 5
    <311>   DW_AT_decl_line   : 44
    <312>   DW_AT_decl_column : 3
    <313>   DW_AT_type        : <0x2e7>
 <1><317>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <318>   DW_AT_encoding    : 7	(unsigned)
    <318>   DW_AT_byte_size   : 1
    <318>   DW_AT_type        : <0x3d>
    <31c>   DW_AT_decl_file   : 5
    <31d>   DW_AT_decl_line   : 50
    <31e>   DW_AT_decl_column : 1
    <31e>   DW_AT_sibling     : <0x32f>
 <2><322>: Abbrev Number: 3 (DW_TAG_enumerator)
    <323>   DW_AT_name        : (indirect string, offset: 0x36416): HAL_UNLOCKED
    <327>   DW_AT_const_value : 0
 <2><328>: Abbrev Number: 3 (DW_TAG_enumerator)
    <329>   DW_AT_name        : (indirect string, offset: 0x4da2c): HAL_LOCKED
    <32d>   DW_AT_const_value : 1
 <2><32e>: Abbrev Number: 0
 <1><32f>: Abbrev Number: 4 (DW_TAG_typedef)
    <330>   DW_AT_name        : (indirect string, offset: 0x356ca): HAL_LockTypeDef
    <334>   DW_AT_decl_file   : 5
    <335>   DW_AT_decl_line   : 53
    <336>   DW_AT_decl_column : 3
    <337>   DW_AT_type        : <0x317>
 <1><33b>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <33c>   DW_AT_encoding    : 7	(unsigned)
    <33c>   DW_AT_byte_size   : 1
    <33c>   DW_AT_type        : <0x3d>
    <340>   DW_AT_decl_file   : 6
    <341>   DW_AT_decl_line   : 68
    <342>   DW_AT_decl_column : 1
    <342>   DW_AT_sibling     : <0x353>
 <2><346>: Abbrev Number: 3 (DW_TAG_enumerator)
    <347>   DW_AT_name        : (indirect string, offset: 0x654ba): GPIO_PIN_RESET
    <34b>   DW_AT_const_value : 0
 <2><34c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <34d>   DW_AT_name        : (indirect string, offset: 0x26cbf): GPIO_PIN_SET
    <351>   DW_AT_const_value : 1
 <2><352>: Abbrev Number: 0
 <1><353>: Abbrev Number: 4 (DW_TAG_typedef)
    <354>   DW_AT_name        : (indirect string, offset: 0x495dc): GPIO_PinState
    <358>   DW_AT_decl_file   : 6
    <359>   DW_AT_decl_line   : 71
    <35a>   DW_AT_decl_column : 2
    <35b>   DW_AT_type        : <0x33b>
 <1><35f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <360>   DW_AT_byte_size   : 48
    <361>   DW_AT_decl_file   : 7
    <362>   DW_AT_decl_line   : 48
    <363>   DW_AT_decl_column : 9
    <363>   DW_AT_sibling     : <0x404>
 <2><367>: Abbrev Number: 2 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x78a02): Channel
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 50
    <36e>   DW_AT_decl_column : 12
    <36f>   DW_AT_type        : <0xac>
    <373>   DW_AT_data_member_location: 0
 <2><374>: Abbrev Number: 2 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x70010): Direction
    <379>   DW_AT_decl_file   : 7
    <37a>   DW_AT_decl_line   : 53
    <37b>   DW_AT_decl_column : 12
    <37c>   DW_AT_type        : <0xac>
    <380>   DW_AT_data_member_location: 4
 <2><381>: Abbrev Number: 2 (DW_TAG_member)
    <382>   DW_AT_name        : (indirect string, offset: 0x3e391): PeriphInc
    <386>   DW_AT_decl_file   : 7
    <387>   DW_AT_decl_line   : 57
    <388>   DW_AT_decl_column : 12
    <389>   DW_AT_type        : <0xac>
    <38d>   DW_AT_data_member_location: 8
 <2><38e>: Abbrev Number: 2 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0xaed1): MemInc
    <393>   DW_AT_decl_file   : 7
    <394>   DW_AT_decl_line   : 60
    <395>   DW_AT_decl_column : 12
    <396>   DW_AT_type        : <0xac>
    <39a>   DW_AT_data_member_location: 12
 <2><39b>: Abbrev Number: 2 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x5500a): PeriphDataAlignment
    <3a0>   DW_AT_decl_file   : 7
    <3a1>   DW_AT_decl_line   : 63
    <3a2>   DW_AT_decl_column : 12
    <3a3>   DW_AT_type        : <0xac>
    <3a7>   DW_AT_data_member_location: 16
 <2><3a8>: Abbrev Number: 2 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x341dd): MemDataAlignment
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 66
    <3af>   DW_AT_decl_column : 12
    <3b0>   DW_AT_type        : <0xac>
    <3b4>   DW_AT_data_member_location: 20
 <2><3b5>: Abbrev Number: 2 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0xfc0e): Mode
    <3ba>   DW_AT_decl_file   : 7
    <3bb>   DW_AT_decl_line   : 69
    <3bc>   DW_AT_decl_column : 12
    <3bd>   DW_AT_type        : <0xac>
    <3c1>   DW_AT_data_member_location: 24
 <2><3c2>: Abbrev Number: 2 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x920eb): Priority
    <3c7>   DW_AT_decl_file   : 7
    <3c8>   DW_AT_decl_line   : 74
    <3c9>   DW_AT_decl_column : 12
    <3ca>   DW_AT_type        : <0xac>
    <3ce>   DW_AT_data_member_location: 28
 <2><3cf>: Abbrev Number: 2 (DW_TAG_member)
    <3d0>   DW_AT_name        : (indirect string, offset: 0xc779): FIFOMode
    <3d4>   DW_AT_decl_file   : 7
    <3d5>   DW_AT_decl_line   : 77
    <3d6>   DW_AT_decl_column : 12
    <3d7>   DW_AT_type        : <0xac>
    <3db>   DW_AT_data_member_location: 32
 <2><3dc>: Abbrev Number: 2 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x3189b): FIFOThreshold
    <3e1>   DW_AT_decl_file   : 7
    <3e2>   DW_AT_decl_line   : 82
    <3e3>   DW_AT_decl_column : 12
    <3e4>   DW_AT_type        : <0xac>
    <3e8>   DW_AT_data_member_location: 36
 <2><3e9>: Abbrev Number: 2 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x702f2): MemBurst
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 85
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xac>
    <3f5>   DW_AT_data_member_location: 40
 <2><3f6>: Abbrev Number: 2 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x77806): PeriphBurst
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 91
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xac>
    <402>   DW_AT_data_member_location: 44
 <2><403>: Abbrev Number: 0
 <1><404>: Abbrev Number: 4 (DW_TAG_typedef)
    <405>   DW_AT_name        : (indirect string, offset: 0x5e564): DMA_InitTypeDef
    <409>   DW_AT_decl_file   : 7
    <40a>   DW_AT_decl_line   : 96
    <40b>   DW_AT_decl_column : 2
    <40c>   DW_AT_type        : <0x35f>
 <1><410>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <411>   DW_AT_encoding    : 7	(unsigned)
    <411>   DW_AT_byte_size   : 1
    <411>   DW_AT_type        : <0x3d>
    <415>   DW_AT_decl_file   : 7
    <416>   DW_AT_decl_line   : 103
    <417>   DW_AT_decl_column : 1
    <417>   DW_AT_sibling     : <0x440>
 <2><41b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <41c>   DW_AT_name        : (indirect string, offset: 0x1185): HAL_DMA_STATE_RESET
    <420>   DW_AT_const_value : 0
 <2><421>: Abbrev Number: 3 (DW_TAG_enumerator)
    <422>   DW_AT_name        : (indirect string, offset: 0x98cd): HAL_DMA_STATE_READY
    <426>   DW_AT_const_value : 1
 <2><427>: Abbrev Number: 3 (DW_TAG_enumerator)
    <428>   DW_AT_name        : (indirect string, offset: 0x56a6a): HAL_DMA_STATE_BUSY
    <42c>   DW_AT_const_value : 2
 <2><42d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <42e>   DW_AT_name        : (indirect string, offset: 0x409ce): HAL_DMA_STATE_TIMEOUT
    <432>   DW_AT_const_value : 3
 <2><433>: Abbrev Number: 3 (DW_TAG_enumerator)
    <434>   DW_AT_name        : (indirect string, offset: 0x2e452): HAL_DMA_STATE_ERROR
    <438>   DW_AT_const_value : 4
 <2><439>: Abbrev Number: 3 (DW_TAG_enumerator)
    <43a>   DW_AT_name        : (indirect string, offset: 0x28c8e): HAL_DMA_STATE_ABORT
    <43e>   DW_AT_const_value : 5
 <2><43f>: Abbrev Number: 0
 <1><440>: Abbrev Number: 4 (DW_TAG_typedef)
    <441>   DW_AT_name        : (indirect string, offset: 0x653ef): HAL_DMA_StateTypeDef
    <445>   DW_AT_decl_file   : 7
    <446>   DW_AT_decl_line   : 110
    <447>   DW_AT_decl_column : 2
    <448>   DW_AT_type        : <0x410>
 <1><44c>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <44d>   DW_AT_type        : <0x440>
 <1><451>: Abbrev Number: 23 (DW_TAG_structure_type)
    <452>   DW_AT_name        : (indirect string, offset: 0x6baa1): __DMA_HandleTypeDef
    <456>   DW_AT_byte_size   : 96
    <457>   DW_AT_decl_file   : 7
    <458>   DW_AT_decl_line   : 138
    <459>   DW_AT_decl_column : 16
    <45a>   DW_AT_sibling     : <0x515>
 <2><45e>: Abbrev Number: 2 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0x81acb): Instance
    <463>   DW_AT_decl_file   : 7
    <464>   DW_AT_decl_line   : 140
    <465>   DW_AT_decl_column : 31
    <466>   DW_AT_type        : <0x515>
    <46a>   DW_AT_data_member_location: 0
 <2><46b>: Abbrev Number: 2 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0x90a8e): Init
    <470>   DW_AT_decl_file   : 7
    <471>   DW_AT_decl_line   : 142
    <472>   DW_AT_decl_column : 30
    <473>   DW_AT_type        : <0x404>
    <477>   DW_AT_data_member_location: 4
 <2><478>: Abbrev Number: 2 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x44c7f): Lock
    <47d>   DW_AT_decl_file   : 7
    <47e>   DW_AT_decl_line   : 144
    <47f>   DW_AT_decl_column : 30
    <480>   DW_AT_type        : <0x32f>
    <484>   DW_AT_data_member_location: 52
 <2><485>: Abbrev Number: 2 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x90bfa): State
    <48a>   DW_AT_decl_file   : 7
    <48b>   DW_AT_decl_line   : 146
    <48c>   DW_AT_decl_column : 30
    <48d>   DW_AT_type        : <0x44c>
    <491>   DW_AT_data_member_location: 53
 <2><492>: Abbrev Number: 2 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x587b0): Parent
    <497>   DW_AT_decl_file   : 7
    <498>   DW_AT_decl_line   : 148
    <499>   DW_AT_decl_column : 31
    <49a>   DW_AT_type        : <0x51a>
    <49e>   DW_AT_data_member_location: 56
 <2><49f>: Abbrev Number: 2 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x57ce7): XferCpltCallback
    <4a4>   DW_AT_decl_file   : 7
    <4a5>   DW_AT_decl_line   : 150
    <4a6>   DW_AT_decl_column : 33
    <4a7>   DW_AT_type        : <0x52c>
    <4ab>   DW_AT_data_member_location: 60
 <2><4ac>: Abbrev Number: 2 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0xac03): XferHalfCpltCallback
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 152
    <4b3>   DW_AT_decl_column : 33
    <4b4>   DW_AT_type        : <0x52c>
    <4b8>   DW_AT_data_member_location: 64
 <2><4b9>: Abbrev Number: 2 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x729aa): XferM1CpltCallback
    <4be>   DW_AT_decl_file   : 7
    <4bf>   DW_AT_decl_line   : 154
    <4c0>   DW_AT_decl_column : 33
    <4c1>   DW_AT_type        : <0x52c>
    <4c5>   DW_AT_data_member_location: 68
 <2><4c6>: Abbrev Number: 2 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x28a40): XferM1HalfCpltCallback
    <4cb>   DW_AT_decl_file   : 7
    <4cc>   DW_AT_decl_line   : 156
    <4cd>   DW_AT_decl_column : 33
    <4ce>   DW_AT_type        : <0x52c>
    <4d2>   DW_AT_data_member_location: 72
 <2><4d3>: Abbrev Number: 2 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x82dcc): XferErrorCallback
    <4d8>   DW_AT_decl_file   : 7
    <4d9>   DW_AT_decl_line   : 158
    <4da>   DW_AT_decl_column : 33
    <4db>   DW_AT_type        : <0x52c>
    <4df>   DW_AT_data_member_location: 76
 <2><4e0>: Abbrev Number: 2 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x6f23): XferAbortCallback
    <4e5>   DW_AT_decl_file   : 7
    <4e6>   DW_AT_decl_line   : 160
    <4e7>   DW_AT_decl_column : 33
    <4e8>   DW_AT_type        : <0x52c>
    <4ec>   DW_AT_data_member_location: 80
 <2><4ed>: Abbrev Number: 2 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x45771): ErrorCode
    <4f2>   DW_AT_decl_file   : 7
    <4f3>   DW_AT_decl_line   : 162
    <4f4>   DW_AT_decl_column : 30
    <4f5>   DW_AT_type        : <0xb8>
    <4f9>   DW_AT_data_member_location: 84
 <2><4fa>: Abbrev Number: 2 (DW_TAG_member)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x341a2): StreamBaseAddress
    <4ff>   DW_AT_decl_file   : 7
    <500>   DW_AT_decl_line   : 164
    <501>   DW_AT_decl_column : 30
    <502>   DW_AT_type        : <0xac>
    <506>   DW_AT_data_member_location: 88
 <2><507>: Abbrev Number: 2 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x28c65): StreamIndex
    <50c>   DW_AT_decl_file   : 7
    <50d>   DW_AT_decl_line   : 166
    <50e>   DW_AT_decl_column : 30
    <50f>   DW_AT_type        : <0xac>
    <513>   DW_AT_data_member_location: 92
 <2><514>: Abbrev Number: 0
 <1><515>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <516>   DW_AT_byte_size   : 4
    <516>   DW_AT_type        : <0x10d>
 <1><51a>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <51b>   DW_AT_byte_size   : 4
 <1><51c>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <51d>   DW_AT_prototyped  : 1
    <51d>   DW_AT_sibling     : <0x527>
 <2><521>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <522>   DW_AT_type        : <0x527>
 <2><526>: Abbrev Number: 0
 <1><527>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <528>   DW_AT_byte_size   : 4
    <528>   DW_AT_type        : <0x451>
 <1><52c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <52d>   DW_AT_byte_size   : 4
    <52d>   DW_AT_type        : <0x51c>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0x6baa3): DMA_HandleTypeDef
    <536>   DW_AT_decl_file   : 7
    <537>   DW_AT_decl_line   : 168
    <538>   DW_AT_decl_column : 2
    <539>   DW_AT_type        : <0x451>
 <1><53d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <53e>   DW_AT_byte_size   : 24
    <53f>   DW_AT_decl_file   : 8
    <540>   DW_AT_decl_line   : 46
    <541>   DW_AT_decl_column : 9
    <541>   DW_AT_sibling     : <0x594>
 <2><545>: Abbrev Number: 2 (DW_TAG_member)
    <546>   DW_AT_name        : (indirect string, offset: 0x9157f): Prescaler
    <54a>   DW_AT_decl_file   : 8
    <54b>   DW_AT_decl_line   : 48
    <54c>   DW_AT_decl_column : 12
    <54d>   DW_AT_type        : <0xac>
    <551>   DW_AT_data_member_location: 0
 <2><552>: Abbrev Number: 2 (DW_TAG_member)
    <553>   DW_AT_name        : (indirect string, offset: 0x594f2): CounterMode
    <557>   DW_AT_decl_file   : 8
    <558>   DW_AT_decl_line   : 51
    <559>   DW_AT_decl_column : 12
    <55a>   DW_AT_type        : <0xac>
    <55e>   DW_AT_data_member_location: 4
 <2><55f>: Abbrev Number: 2 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0x1d09f): Period
    <564>   DW_AT_decl_file   : 8
    <565>   DW_AT_decl_line   : 54
    <566>   DW_AT_decl_column : 12
    <567>   DW_AT_type        : <0xac>
    <56b>   DW_AT_data_member_location: 8
 <2><56c>: Abbrev Number: 2 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x3cdaf): ClockDivision
    <571>   DW_AT_decl_file   : 8
    <572>   DW_AT_decl_line   : 58
    <573>   DW_AT_decl_column : 12
    <574>   DW_AT_type        : <0xac>
    <578>   DW_AT_data_member_location: 12
 <2><579>: Abbrev Number: 2 (DW_TAG_member)
    <57a>   DW_AT_name        : (indirect string, offset: 0x81974): RepetitionCounter
    <57e>   DW_AT_decl_file   : 8
    <57f>   DW_AT_decl_line   : 61
    <580>   DW_AT_decl_column : 12
    <581>   DW_AT_type        : <0xac>
    <585>   DW_AT_data_member_location: 16
 <2><586>: Abbrev Number: 2 (DW_TAG_member)
    <587>   DW_AT_name        : (indirect string, offset: 0x2361a): AutoReloadPreload
    <58b>   DW_AT_decl_file   : 8
    <58c>   DW_AT_decl_line   : 72
    <58d>   DW_AT_decl_column : 12
    <58e>   DW_AT_type        : <0xac>
    <592>   DW_AT_data_member_location: 20
 <2><593>: Abbrev Number: 0
 <1><594>: Abbrev Number: 4 (DW_TAG_typedef)
    <595>   DW_AT_name        : (indirect string, offset: 0x2c6ca): TIM_Base_InitTypeDef
    <599>   DW_AT_decl_file   : 8
    <59a>   DW_AT_decl_line   : 74
    <59b>   DW_AT_decl_column : 3
    <59c>   DW_AT_type        : <0x53d>
 <1><5a0>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5a1>   DW_AT_byte_size   : 28
    <5a2>   DW_AT_decl_file   : 8
    <5a3>   DW_AT_decl_line   : 79
    <5a4>   DW_AT_decl_column : 9
    <5a4>   DW_AT_sibling     : <0x604>
 <2><5a8>: Abbrev Number: 2 (DW_TAG_member)
    <5a9>   DW_AT_name        : (indirect string, offset: 0xfc0c): OCMode
    <5ad>   DW_AT_decl_file   : 8
    <5ae>   DW_AT_decl_line   : 81
    <5af>   DW_AT_decl_column : 12
    <5b0>   DW_AT_type        : <0xac>
    <5b4>   DW_AT_data_member_location: 0
 <2><5b5>: Abbrev Number: 2 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x9575): Pulse
    <5ba>   DW_AT_decl_file   : 8
    <5bb>   DW_AT_decl_line   : 84
    <5bc>   DW_AT_decl_column : 12
    <5bd>   DW_AT_type        : <0xac>
    <5c1>   DW_AT_data_member_location: 4
 <2><5c2>: Abbrev Number: 2 (DW_TAG_member)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x61f38): OCPolarity
    <5c7>   DW_AT_decl_file   : 8
    <5c8>   DW_AT_decl_line   : 87
    <5c9>   DW_AT_decl_column : 12
    <5ca>   DW_AT_type        : <0xac>
    <5ce>   DW_AT_data_member_location: 8
 <2><5cf>: Abbrev Number: 2 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x63952): OCNPolarity
    <5d4>   DW_AT_decl_file   : 8
    <5d5>   DW_AT_decl_line   : 90
    <5d6>   DW_AT_decl_column : 12
    <5d7>   DW_AT_type        : <0xac>
    <5db>   DW_AT_data_member_location: 12
 <2><5dc>: Abbrev Number: 2 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0x44985): OCFastMode
    <5e1>   DW_AT_decl_file   : 8
    <5e2>   DW_AT_decl_line   : 94
    <5e3>   DW_AT_decl_column : 12
    <5e4>   DW_AT_type        : <0xac>
    <5e8>   DW_AT_data_member_location: 16
 <2><5e9>: Abbrev Number: 2 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x7b13): OCIdleState
    <5ee>   DW_AT_decl_file   : 8
    <5ef>   DW_AT_decl_line   : 99
    <5f0>   DW_AT_decl_column : 12
    <5f1>   DW_AT_type        : <0xac>
    <5f5>   DW_AT_data_member_location: 20
 <2><5f6>: Abbrev Number: 2 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x509a1): OCNIdleState
    <5fb>   DW_AT_decl_file   : 8
    <5fc>   DW_AT_decl_line   : 103
    <5fd>   DW_AT_decl_column : 12
    <5fe>   DW_AT_type        : <0xac>
    <602>   DW_AT_data_member_location: 24
 <2><603>: Abbrev Number: 0
 <1><604>: Abbrev Number: 4 (DW_TAG_typedef)
    <605>   DW_AT_name        : (indirect string, offset: 0x1d9d5): TIM_OC_InitTypeDef
    <609>   DW_AT_decl_file   : 8
    <60a>   DW_AT_decl_line   : 106
    <60b>   DW_AT_decl_column : 3
    <60c>   DW_AT_type        : <0x5a0>
 <1><610>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <611>   DW_AT_encoding    : 7	(unsigned)
    <611>   DW_AT_byte_size   : 1
    <611>   DW_AT_type        : <0x3d>
    <615>   DW_AT_decl_file   : 8
    <615>   DW_AT_decl_line   : 291
    <617>   DW_AT_decl_column : 1
    <617>   DW_AT_sibling     : <0x63a>
 <2><61b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <61c>   DW_AT_name        : (indirect string, offset: 0x85a53): HAL_TIM_STATE_RESET
    <620>   DW_AT_const_value : 0
 <2><621>: Abbrev Number: 3 (DW_TAG_enumerator)
    <622>   DW_AT_name        : (indirect string, offset: 0x7b53): HAL_TIM_STATE_READY
    <626>   DW_AT_const_value : 1
 <2><627>: Abbrev Number: 3 (DW_TAG_enumerator)
    <628>   DW_AT_name        : (indirect string, offset: 0x1d97c): HAL_TIM_STATE_BUSY
    <62c>   DW_AT_const_value : 2
 <2><62d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <62e>   DW_AT_name        : (indirect string, offset: 0x5736e): HAL_TIM_STATE_TIMEOUT
    <632>   DW_AT_const_value : 3
 <2><633>: Abbrev Number: 3 (DW_TAG_enumerator)
    <634>   DW_AT_name        : (indirect string, offset: 0x3ec5a): HAL_TIM_STATE_ERROR
    <638>   DW_AT_const_value : 4
 <2><639>: Abbrev Number: 0
 <1><63a>: Abbrev Number: 10 (DW_TAG_typedef)
    <63b>   DW_AT_name        : (indirect string, offset: 0x61440): HAL_TIM_StateTypeDef
    <63f>   DW_AT_decl_file   : 8
    <640>   DW_AT_decl_line   : 297
    <642>   DW_AT_decl_column : 3
    <642>   DW_AT_type        : <0x610>
 <1><646>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <647>   DW_AT_type        : <0x63a>
 <1><64b>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <64c>   DW_AT_encoding    : 7	(unsigned)
    <64c>   DW_AT_byte_size   : 1
    <64c>   DW_AT_type        : <0x3d>
    <650>   DW_AT_decl_file   : 8
    <650>   DW_AT_decl_line   : 303
    <652>   DW_AT_decl_column : 1
    <652>   DW_AT_sibling     : <0x669>
 <2><656>: Abbrev Number: 3 (DW_TAG_enumerator)
    <657>   DW_AT_name        : (indirect string, offset: 0x363fa): HAL_TIM_CHANNEL_STATE_RESET
    <65b>   DW_AT_const_value : 0
 <2><65c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <65d>   DW_AT_name        : (indirect string, offset: 0x3eb38): HAL_TIM_CHANNEL_STATE_READY
    <661>   DW_AT_const_value : 1
 <2><662>: Abbrev Number: 3 (DW_TAG_enumerator)
    <663>   DW_AT_name        : (indirect string, offset: 0x79295): HAL_TIM_CHANNEL_STATE_BUSY
    <667>   DW_AT_const_value : 2
 <2><668>: Abbrev Number: 0
 <1><669>: Abbrev Number: 10 (DW_TAG_typedef)
    <66a>   DW_AT_name        : (indirect string, offset: 0x7e5ef): HAL_TIM_ChannelStateTypeDef
    <66e>   DW_AT_decl_file   : 8
    <66f>   DW_AT_decl_line   : 307
    <671>   DW_AT_decl_column : 3
    <671>   DW_AT_type        : <0x64b>
 <1><675>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <676>   DW_AT_type        : <0x669>
 <1><67a>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <67b>   DW_AT_encoding    : 7	(unsigned)
    <67b>   DW_AT_byte_size   : 1
    <67b>   DW_AT_type        : <0x3d>
    <67f>   DW_AT_decl_file   : 8
    <67f>   DW_AT_decl_line   : 313
    <681>   DW_AT_decl_column : 1
    <681>   DW_AT_sibling     : <0x698>
 <2><685>: Abbrev Number: 3 (DW_TAG_enumerator)
    <686>   DW_AT_name        : (indirect string, offset: 0x43864): HAL_DMA_BURST_STATE_RESET
    <68a>   DW_AT_const_value : 0
 <2><68b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <68c>   DW_AT_name        : (indirect string, offset: 0x4bb84): HAL_DMA_BURST_STATE_READY
    <690>   DW_AT_const_value : 1
 <2><691>: Abbrev Number: 3 (DW_TAG_enumerator)
    <692>   DW_AT_name        : (indirect string, offset: 0x513bb): HAL_DMA_BURST_STATE_BUSY
    <696>   DW_AT_const_value : 2
 <2><697>: Abbrev Number: 0
 <1><698>: Abbrev Number: 10 (DW_TAG_typedef)
    <699>   DW_AT_name        : (indirect string, offset: 0x6d703): HAL_TIM_DMABurstStateTypeDef
    <69d>   DW_AT_decl_file   : 8
    <69e>   DW_AT_decl_line   : 317
    <6a0>   DW_AT_decl_column : 3
    <6a0>   DW_AT_type        : <0x67a>
 <1><6a4>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <6a5>   DW_AT_type        : <0x698>
 <1><6a9>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <6aa>   DW_AT_encoding    : 7	(unsigned)
    <6aa>   DW_AT_byte_size   : 1
    <6aa>   DW_AT_type        : <0x3d>
    <6ae>   DW_AT_decl_file   : 8
    <6ae>   DW_AT_decl_line   : 323
    <6b0>   DW_AT_decl_column : 1
    <6b0>   DW_AT_sibling     : <0x6d3>
 <2><6b4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6b5>   DW_AT_name        : (indirect string, offset: 0x5261): HAL_TIM_ACTIVE_CHANNEL_1
    <6b9>   DW_AT_const_value : 1
 <2><6ba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x527a): HAL_TIM_ACTIVE_CHANNEL_2
    <6bf>   DW_AT_const_value : 2
 <2><6c0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x5293): HAL_TIM_ACTIVE_CHANNEL_3
    <6c5>   DW_AT_const_value : 4
 <2><6c6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x52ac): HAL_TIM_ACTIVE_CHANNEL_4
    <6cb>   DW_AT_const_value : 8
 <2><6cc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x84a58): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <6d1>   DW_AT_const_value : 0
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 10 (DW_TAG_typedef)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x789f4): HAL_TIM_ActiveChannel
    <6d8>   DW_AT_decl_file   : 8
    <6d9>   DW_AT_decl_line   : 329
    <6db>   DW_AT_decl_column : 3
    <6db>   DW_AT_type        : <0x6a9>
 <1><6df>: Abbrev Number: 25 (DW_TAG_structure_type)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x83a9f): __TIM_HandleTypeDef
    <6e4>   DW_AT_byte_size   : 180
    <6e5>   DW_AT_decl_file   : 8
    <6e6>   DW_AT_decl_line   : 335
    <6e8>   DW_AT_decl_column : 16
    <6e9>   DW_AT_sibling     : <0x8e6>
 <2><6ed>: Abbrev Number: 1 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x81acb): Instance
    <6f2>   DW_AT_decl_file   : 8
    <6f3>   DW_AT_decl_line   : 340
    <6f5>   DW_AT_decl_column : 39
    <6f6>   DW_AT_type        : <0x8e6>
    <6fa>   DW_AT_data_member_location: 0
 <2><6fb>: Abbrev Number: 1 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x90a8e): Init
    <700>   DW_AT_decl_file   : 8
    <701>   DW_AT_decl_line   : 341
    <703>   DW_AT_decl_column : 38
    <704>   DW_AT_type        : <0x594>
    <708>   DW_AT_data_member_location: 4
 <2><709>: Abbrev Number: 1 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0x78a02): Channel
    <70e>   DW_AT_decl_file   : 8
    <70f>   DW_AT_decl_line   : 342
    <711>   DW_AT_decl_column : 38
    <712>   DW_AT_type        : <0x6d3>
    <716>   DW_AT_data_member_location: 28
 <2><717>: Abbrev Number: 1 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x18f99): hdma
    <71c>   DW_AT_decl_file   : 8
    <71d>   DW_AT_decl_line   : 343
    <71f>   DW_AT_decl_column : 39
    <720>   DW_AT_type        : <0x8eb>
    <724>   DW_AT_data_member_location: 32
 <2><725>: Abbrev Number: 1 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x44c7f): Lock
    <72a>   DW_AT_decl_file   : 8
    <72b>   DW_AT_decl_line   : 345
    <72d>   DW_AT_decl_column : 38
    <72e>   DW_AT_type        : <0x32f>
    <732>   DW_AT_data_member_location: 60
 <2><733>: Abbrev Number: 1 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x90bfa): State
    <738>   DW_AT_decl_file   : 8
    <739>   DW_AT_decl_line   : 346
    <73b>   DW_AT_decl_column : 38
    <73c>   DW_AT_type        : <0x646>
    <740>   DW_AT_data_member_location: 61
 <2><741>: Abbrev Number: 1 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x93125): ChannelState
    <746>   DW_AT_decl_file   : 8
    <747>   DW_AT_decl_line   : 347
    <749>   DW_AT_decl_column : 38
    <74a>   DW_AT_type        : <0x910>
    <74e>   DW_AT_data_member_location: 62
 <2><74f>: Abbrev Number: 1 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x935dd): ChannelNState
    <754>   DW_AT_decl_file   : 8
    <755>   DW_AT_decl_line   : 348
    <757>   DW_AT_decl_column : 38
    <758>   DW_AT_type        : <0x910>
    <75c>   DW_AT_data_member_location: 66
 <2><75d>: Abbrev Number: 1 (DW_TAG_member)
    <75e>   DW_AT_name        : (indirect string, offset: 0x92860): DMABurstState
    <762>   DW_AT_decl_file   : 8
    <763>   DW_AT_decl_line   : 349
    <765>   DW_AT_decl_column : 38
    <766>   DW_AT_type        : <0x6a4>
    <76a>   DW_AT_data_member_location: 70
 <2><76b>: Abbrev Number: 1 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x396e1): Base_MspInitCallback
    <770>   DW_AT_decl_file   : 8
    <771>   DW_AT_decl_line   : 352
    <773>   DW_AT_decl_column : 11
    <774>   DW_AT_type        : <0x925>
    <778>   DW_AT_data_member_location: 72
 <2><779>: Abbrev Number: 1 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0x4200b): Base_MspDeInitCallback
    <77e>   DW_AT_decl_file   : 8
    <77f>   DW_AT_decl_line   : 353
    <781>   DW_AT_decl_column : 11
    <782>   DW_AT_type        : <0x925>
    <786>   DW_AT_data_member_location: 76
 <2><787>: Abbrev Number: 1 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0xe0ec): IC_MspInitCallback
    <78c>   DW_AT_decl_file   : 8
    <78d>   DW_AT_decl_line   : 354
    <78f>   DW_AT_decl_column : 11
    <790>   DW_AT_type        : <0x925>
    <794>   DW_AT_data_member_location: 80
 <2><795>: Abbrev Number: 1 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x60b05): IC_MspDeInitCallback
    <79a>   DW_AT_decl_file   : 8
    <79b>   DW_AT_decl_line   : 355
    <79d>   DW_AT_decl_column : 11
    <79e>   DW_AT_type        : <0x925>
    <7a2>   DW_AT_data_member_location: 84
 <2><7a3>: Abbrev Number: 1 (DW_TAG_member)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x5978d): OC_MspInitCallback
    <7a8>   DW_AT_decl_file   : 8
    <7a9>   DW_AT_decl_line   : 356
    <7ab>   DW_AT_decl_column : 11
    <7ac>   DW_AT_type        : <0x925>
    <7b0>   DW_AT_data_member_location: 88
 <2><7b1>: Abbrev Number: 1 (DW_TAG_member)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x5e880): OC_MspDeInitCallback
    <7b6>   DW_AT_decl_file   : 8
    <7b7>   DW_AT_decl_line   : 357
    <7b9>   DW_AT_decl_column : 11
    <7ba>   DW_AT_type        : <0x925>
    <7be>   DW_AT_data_member_location: 92
 <2><7bf>: Abbrev Number: 1 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x55b35): PWM_MspInitCallback
    <7c4>   DW_AT_decl_file   : 8
    <7c5>   DW_AT_decl_line   : 358
    <7c7>   DW_AT_decl_column : 11
    <7c8>   DW_AT_type        : <0x925>
    <7cc>   DW_AT_data_member_location: 96
 <2><7cd>: Abbrev Number: 1 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0x61d24): PWM_MspDeInitCallback
    <7d2>   DW_AT_decl_file   : 8
    <7d3>   DW_AT_decl_line   : 359
    <7d5>   DW_AT_decl_column : 11
    <7d6>   DW_AT_type        : <0x925>
    <7da>   DW_AT_data_member_location: 100
 <2><7db>: Abbrev Number: 1 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0x7b88a): OnePulse_MspInitCallback
    <7e0>   DW_AT_decl_file   : 8
    <7e1>   DW_AT_decl_line   : 360
    <7e3>   DW_AT_decl_column : 11
    <7e4>   DW_AT_type        : <0x925>
    <7e8>   DW_AT_data_member_location: 104
 <2><7e9>: Abbrev Number: 1 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x54525): OnePulse_MspDeInitCallback
    <7ee>   DW_AT_decl_file   : 8
    <7ef>   DW_AT_decl_line   : 361
    <7f1>   DW_AT_decl_column : 11
    <7f2>   DW_AT_type        : <0x925>
    <7f6>   DW_AT_data_member_location: 108
 <2><7f7>: Abbrev Number: 1 (DW_TAG_member)
    <7f8>   DW_AT_name        : (indirect string, offset: 0x3be2f): Encoder_MspInitCallback
    <7fc>   DW_AT_decl_file   : 8
    <7fd>   DW_AT_decl_line   : 362
    <7ff>   DW_AT_decl_column : 11
    <800>   DW_AT_type        : <0x925>
    <804>   DW_AT_data_member_location: 112
 <2><805>: Abbrev Number: 1 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0x6c3b0): Encoder_MspDeInitCallback
    <80a>   DW_AT_decl_file   : 8
    <80b>   DW_AT_decl_line   : 363
    <80d>   DW_AT_decl_column : 11
    <80e>   DW_AT_type        : <0x925>
    <812>   DW_AT_data_member_location: 116
 <2><813>: Abbrev Number: 1 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0x1b681): HallSensor_MspInitCallback
    <818>   DW_AT_decl_file   : 8
    <819>   DW_AT_decl_line   : 364
    <81b>   DW_AT_decl_column : 11
    <81c>   DW_AT_type        : <0x925>
    <820>   DW_AT_data_member_location: 120
 <2><821>: Abbrev Number: 1 (DW_TAG_member)
    <822>   DW_AT_name        : (indirect string, offset: 0x6847): HallSensor_MspDeInitCallback
    <826>   DW_AT_decl_file   : 8
    <827>   DW_AT_decl_line   : 365
    <829>   DW_AT_decl_column : 11
    <82a>   DW_AT_type        : <0x925>
    <82e>   DW_AT_data_member_location: 124
 <2><82f>: Abbrev Number: 1 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x90ad9): PeriodElapsedCallback
    <834>   DW_AT_decl_file   : 8
    <835>   DW_AT_decl_line   : 366
    <837>   DW_AT_decl_column : 11
    <838>   DW_AT_type        : <0x925>
    <83c>   DW_AT_data_member_location: 128
 <2><83d>: Abbrev Number: 1 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x93172): PeriodElapsedHalfCpltCallback
    <842>   DW_AT_decl_file   : 8
    <843>   DW_AT_decl_line   : 367
    <845>   DW_AT_decl_column : 11
    <846>   DW_AT_type        : <0x925>
    <84a>   DW_AT_data_member_location: 132
 <2><84b>: Abbrev Number: 1 (DW_TAG_member)
    <84c>   DW_AT_name        : (indirect string, offset: 0x92779): TriggerCallback
    <850>   DW_AT_decl_file   : 8
    <851>   DW_AT_decl_line   : 368
    <853>   DW_AT_decl_column : 11
    <854>   DW_AT_type        : <0x925>
    <858>   DW_AT_data_member_location: 136
 <2><859>: Abbrev Number: 1 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x930f2): TriggerHalfCpltCallback
    <85e>   DW_AT_decl_file   : 8
    <85f>   DW_AT_decl_line   : 369
    <861>   DW_AT_decl_column : 11
    <862>   DW_AT_type        : <0x925>
    <866>   DW_AT_data_member_location: 140
 <2><867>: Abbrev Number: 1 (DW_TAG_member)
    <868>   DW_AT_name        : (indirect string, offset: 0x90a66): IC_CaptureCallback
    <86c>   DW_AT_decl_file   : 8
    <86d>   DW_AT_decl_line   : 370
    <86f>   DW_AT_decl_column : 11
    <870>   DW_AT_type        : <0x925>
    <874>   DW_AT_data_member_location: 144
 <2><875>: Abbrev Number: 1 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0x92fea): IC_CaptureHalfCpltCallback
    <87a>   DW_AT_decl_file   : 8
    <87b>   DW_AT_decl_line   : 371
    <87d>   DW_AT_decl_column : 11
    <87e>   DW_AT_type        : <0x925>
    <882>   DW_AT_data_member_location: 148
 <2><883>: Abbrev Number: 1 (DW_TAG_member)
    <884>   DW_AT_name        : (indirect string, offset: 0x92e51): OC_DelayElapsedCallback
    <888>   DW_AT_decl_file   : 8
    <889>   DW_AT_decl_line   : 372
    <88b>   DW_AT_decl_column : 11
    <88c>   DW_AT_type        : <0x925>
    <890>   DW_AT_data_member_location: 152
 <2><891>: Abbrev Number: 1 (DW_TAG_member)
    <892>   DW_AT_name        : (indirect string, offset: 0x92f79): PWM_PulseFinishedCallback
    <896>   DW_AT_decl_file   : 8
    <897>   DW_AT_decl_line   : 373
    <899>   DW_AT_decl_column : 11
    <89a>   DW_AT_type        : <0x925>
    <89e>   DW_AT_data_member_location: 156
 <2><89f>: Abbrev Number: 1 (DW_TAG_member)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x927b1): PWM_PulseFinishedHalfCpltCallback
    <8a4>   DW_AT_decl_file   : 8
    <8a5>   DW_AT_decl_line   : 374
    <8a7>   DW_AT_decl_column : 11
    <8a8>   DW_AT_type        : <0x925>
    <8ac>   DW_AT_data_member_location: 160
 <2><8ad>: Abbrev Number: 1 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x932d7): ErrorCallback
    <8b2>   DW_AT_decl_file   : 8
    <8b3>   DW_AT_decl_line   : 375
    <8b5>   DW_AT_decl_column : 11
    <8b6>   DW_AT_type        : <0x925>
    <8ba>   DW_AT_data_member_location: 164
 <2><8bb>: Abbrev Number: 1 (DW_TAG_member)
    <8bc>   DW_AT_name        : (indirect string, offset: 0x1bc36): CommutationCallback
    <8c0>   DW_AT_decl_file   : 8
    <8c1>   DW_AT_decl_line   : 376
    <8c3>   DW_AT_decl_column : 11
    <8c4>   DW_AT_type        : <0x925>
    <8c8>   DW_AT_data_member_location: 168
 <2><8c9>: Abbrev Number: 1 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xebe3): CommutationHalfCpltCallback
    <8ce>   DW_AT_decl_file   : 8
    <8cf>   DW_AT_decl_line   : 377
    <8d1>   DW_AT_decl_column : 11
    <8d2>   DW_AT_type        : <0x925>
    <8d6>   DW_AT_data_member_location: 172
 <2><8d7>: Abbrev Number: 1 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x928d6): BreakCallback
    <8dc>   DW_AT_decl_file   : 8
    <8dd>   DW_AT_decl_line   : 378
    <8df>   DW_AT_decl_column : 11
    <8e0>   DW_AT_type        : <0x925>
    <8e4>   DW_AT_data_member_location: 176
 <2><8e5>: Abbrev Number: 0
 <1><8e6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8e7>   DW_AT_byte_size   : 4
    <8e7>   DW_AT_type        : <0x2d4>
 <1><8eb>: Abbrev Number: 16 (DW_TAG_array_type)
    <8ec>   DW_AT_type        : <0x8fb>
    <8f0>   DW_AT_sibling     : <0x8fb>
 <2><8f4>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <8f5>   DW_AT_type        : <0x8d>
    <8f9>   DW_AT_upper_bound : 6
 <2><8fa>: Abbrev Number: 0
 <1><8fb>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8fc>   DW_AT_byte_size   : 4
    <8fc>   DW_AT_type        : <0x531>
 <1><900>: Abbrev Number: 16 (DW_TAG_array_type)
    <901>   DW_AT_type        : <0x675>
    <905>   DW_AT_sibling     : <0x910>
 <2><909>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <90a>   DW_AT_type        : <0x8d>
    <90e>   DW_AT_upper_bound : 3
 <2><90f>: Abbrev Number: 0
 <1><910>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <911>   DW_AT_type        : <0x900>
 <1><915>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <916>   DW_AT_prototyped  : 1
    <916>   DW_AT_sibling     : <0x920>
 <2><91a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <91b>   DW_AT_type        : <0x920>
 <2><91f>: Abbrev Number: 0
 <1><920>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <921>   DW_AT_byte_size   : 4
    <921>   DW_AT_type        : <0x6df>
 <1><925>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <926>   DW_AT_byte_size   : 4
    <926>   DW_AT_type        : <0x915>
 <1><92a>: Abbrev Number: 10 (DW_TAG_typedef)
    <92b>   DW_AT_name        : (indirect string, offset: 0x83aa1): TIM_HandleTypeDef
    <92f>   DW_AT_decl_file   : 8
    <930>   DW_AT_decl_line   : 380
    <932>   DW_AT_decl_column : 3
    <932>   DW_AT_type        : <0x6df>
 <1><936>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <937>   DW_AT_byte_size   : 4
    <937>   DW_AT_type        : <0x92a>
 <1><93b>: Abbrev Number: 26 (DW_TAG_variable)
    <93c>   DW_AT_name        : (indirect string, offset: 0x43ba6): htim3
    <940>   DW_AT_decl_file   : 9
    <941>   DW_AT_decl_line   : 37
    <942>   DW_AT_decl_column : 26
    <943>   DW_AT_type        : <0x92a>
    <947>   DW_AT_external    : 1
    <947>   DW_AT_declaration : 1
 <1><947>: Abbrev Number: 27 (DW_TAG_variable)
    <948>   DW_AT_name        : (indirect string, offset: 0x50386): STATE
    <94c>   DW_AT_decl_file   : 1
    <94d>   DW_AT_decl_line   : 12
    <94e>   DW_AT_decl_column : 9
    <94f>   DW_AT_type        : <0x94>
    <953>   DW_AT_external    : 1
    <953>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><959>: Abbrev Number: 18 (DW_TAG_subprogram)
    <95a>   DW_AT_external    : 1
    <95a>   DW_AT_name        : (indirect string, offset: 0x5a7da): HAL_TIM_PWM_Start
    <95e>   DW_AT_decl_file   : 8
    <95e>   DW_AT_decl_line   : 1937
    <960>   DW_AT_decl_column : 19
    <960>   DW_AT_prototyped  : 1
    <960>   DW_AT_type        : <0x30b>
    <964>   DW_AT_declaration : 1
    <964>   DW_AT_sibling     : <0x973>
 <2><968>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <969>   DW_AT_type        : <0x936>
 <2><96d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <96e>   DW_AT_type        : <0xac>
 <2><972>: Abbrev Number: 0
 <1><973>: Abbrev Number: 18 (DW_TAG_subprogram)
    <974>   DW_AT_external    : 1
    <974>   DW_AT_name        : (indirect string, offset: 0x79dac): HAL_TIM_PWM_ConfigChannel
    <978>   DW_AT_decl_file   : 8
    <978>   DW_AT_decl_line   : 2029
    <97a>   DW_AT_decl_column : 19
    <97a>   DW_AT_prototyped  : 1
    <97a>   DW_AT_type        : <0x30b>
    <97e>   DW_AT_declaration : 1
    <97e>   DW_AT_sibling     : <0x992>
 <2><982>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <983>   DW_AT_type        : <0x936>
 <2><987>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <988>   DW_AT_type        : <0x992>
 <2><98c>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <98d>   DW_AT_type        : <0xac>
 <2><991>: Abbrev Number: 0
 <1><992>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <993>   DW_AT_byte_size   : 4
    <993>   DW_AT_type        : <0x604>
 <1><997>: Abbrev Number: 18 (DW_TAG_subprogram)
    <998>   DW_AT_external    : 1
    <998>   DW_AT_name        : (indirect string, offset: 0x5415f): HAL_TIM_PWM_Init
    <99c>   DW_AT_decl_file   : 8
    <99c>   DW_AT_decl_line   : 1932
    <99e>   DW_AT_decl_column : 19
    <99e>   DW_AT_prototyped  : 1
    <99e>   DW_AT_type        : <0x30b>
    <9a2>   DW_AT_declaration : 1
    <9a2>   DW_AT_sibling     : <0x9ac>
 <2><9a6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9a7>   DW_AT_type        : <0x936>
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 28 (DW_TAG_subprogram)
    <9ad>   DW_AT_external    : 1
    <9ad>   DW_AT_name        : (indirect string, offset: 0x760a): HAL_GPIO_WritePin
    <9b1>   DW_AT_decl_file   : 6
    <9b2>   DW_AT_decl_line   : 235
    <9b3>   DW_AT_decl_column : 6
    <9b4>   DW_AT_prototyped  : 1
    <9b4>   DW_AT_declaration : 1
    <9b4>   DW_AT_sibling     : <0x9c8>
 <2><9b8>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9b9>   DW_AT_type        : <0x9c8>
 <2><9bd>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9be>   DW_AT_type        : <0xa0>
 <2><9c2>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9c3>   DW_AT_type        : <0x353>
 <2><9c7>: Abbrev Number: 0
 <1><9c8>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 4
    <9c9>   DW_AT_type        : <0x1af>
 <1><9cd>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9ce>   DW_AT_external    : 1
    <9ce>   DW_AT_name        : (indirect string, offset: 0x7984f): SET_PULSE
    <9d2>   DW_AT_decl_file   : 1
    <9d3>   DW_AT_decl_line   : 88
    <9d4>   DW_AT_decl_column : 8
    <9d5>   DW_AT_prototyped  : 1
    <9d5>   DW_AT_low_pc      : 0x8000634
    <9d9>   DW_AT_high_pc     : 0x4c
    <9dd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9df>   DW_AT_call_all_tail_calls: 1
    <9df>   DW_AT_sibling     : <0xa02>
 <2><9e3>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x7dfec): pulse
    <9e8>   DW_AT_decl_file   : 1
    <9e9>   DW_AT_decl_line   : 88
    <9ea>   DW_AT_decl_column : 27
    <9eb>   DW_AT_type        : <0xac>
    <9ef>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><9f2>: Abbrev Number: 31 (DW_TAG_variable)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x62b0c): sConfig
    <9f7>   DW_AT_decl_file   : 1
    <9f8>   DW_AT_decl_line   : 91
    <9f9>   DW_AT_decl_column : 23
    <9fa>   DW_AT_type        : <0x604>
    <9fe>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><a01>: Abbrev Number: 0
 <1><a02>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a03>   DW_AT_external    : 1
    <a03>   DW_AT_name        : (indirect string, offset: 0x47066): stop
    <a07>   DW_AT_decl_file   : 1
    <a07>   DW_AT_decl_line   : 75
    <a08>   DW_AT_decl_column : 8
    <a08>   DW_AT_prototyped  : 1
    <a08>   DW_AT_low_pc      : 0x80005fc
    <a0c>   DW_AT_high_pc     : 0x38
    <a10>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a12>   DW_AT_call_all_tail_calls: 1
 <1><a12>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a13>   DW_AT_external    : 1
    <a13>   DW_AT_name        : (indirect string, offset: 0x587d8): turn_left_backward
    <a17>   DW_AT_decl_file   : 1
    <a17>   DW_AT_decl_line   : 64
    <a18>   DW_AT_decl_column : 8
    <a18>   DW_AT_prototyped  : 1
    <a18>   DW_AT_low_pc      : 0x80005c4
    <a1c>   DW_AT_high_pc     : 0x38
    <a20>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a22>   DW_AT_call_all_tail_calls: 1
 <1><a22>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a23>   DW_AT_external    : 1
    <a23>   DW_AT_name        : (indirect string, offset: 0xd685): turn_left_forward
    <a27>   DW_AT_decl_file   : 1
    <a27>   DW_AT_decl_line   : 53
    <a28>   DW_AT_decl_column : 8
    <a28>   DW_AT_prototyped  : 1
    <a28>   DW_AT_low_pc      : 0x800058c
    <a2c>   DW_AT_high_pc     : 0x38
    <a30>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a32>   DW_AT_call_all_tail_calls: 1
 <1><a32>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a33>   DW_AT_external    : 1
    <a33>   DW_AT_name        : (indirect string, offset: 0x14cc2): turn_right_backward
    <a37>   DW_AT_decl_file   : 1
    <a37>   DW_AT_decl_line   : 42
    <a38>   DW_AT_decl_column : 8
    <a38>   DW_AT_prototyped  : 1
    <a38>   DW_AT_low_pc      : 0x8000554
    <a3c>   DW_AT_high_pc     : 0x38
    <a40>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a42>   DW_AT_call_all_tail_calls: 1
 <1><a42>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a43>   DW_AT_external    : 1
    <a43>   DW_AT_name        : (indirect string, offset: 0x65497): turn_right_forward
    <a47>   DW_AT_decl_file   : 1
    <a47>   DW_AT_decl_line   : 31
    <a48>   DW_AT_decl_column : 8
    <a48>   DW_AT_prototyped  : 1
    <a48>   DW_AT_low_pc      : 0x800051c
    <a4c>   DW_AT_high_pc     : 0x38
    <a50>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a52>   DW_AT_call_all_tail_calls: 1
 <1><a52>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a53>   DW_AT_external    : 1
    <a53>   DW_AT_name        : (indirect string, offset: 0x2645e): move_backward
    <a57>   DW_AT_decl_file   : 1
    <a57>   DW_AT_decl_line   : 24
    <a58>   DW_AT_decl_column : 8
    <a58>   DW_AT_prototyped  : 1
    <a58>   DW_AT_low_pc      : 0x80004fc
    <a5c>   DW_AT_high_pc     : 0x20
    <a60>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a62>   DW_AT_call_all_tail_calls: 1
 <1><a62>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a63>   DW_AT_external    : 1
    <a63>   DW_AT_name        : (indirect string, offset: 0x53c2): move_Forward
    <a67>   DW_AT_decl_file   : 1
    <a67>   DW_AT_decl_line   : 15
    <a68>   DW_AT_decl_column : 8
    <a68>   DW_AT_prototyped  : 1
    <a68>   DW_AT_low_pc      : 0x80004dc
    <a6c>   DW_AT_high_pc     : 0x20
    <a70>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a72>   DW_AT_call_all_tail_calls: 1
 <1><a72>: Abbrev Number: 0
  Compilation Unit @ offset 0xa73:
   Length:        0x11a1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1f2
   Pointer Size:  4
 <0><a7f>: Abbrev Number: 31 (DW_TAG_compile_unit)
    <a80>   DW_AT_producer    : (indirect string, offset: 0x64295): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a84>   DW_AT_language    : 29	(C11)
    <a85>   DW_AT_name        : (indirect string, offset: 0x905c7): ../Core/Src/freertos.c
    <a89>   DW_AT_comp_dir    : (indirect string, offset: 0x6b948): C:/Users/hp/Desktop/NTI/Auto Parking_Final Update/Debug
    <a8d>   DW_AT_ranges      : 0x49
    <a91>   DW_AT_low_pc      : 0x0
    <a95>   DW_AT_stmt_list   : 0x80d
    <a99>   DW_AT_macros      : 0x1423e
 <1><a9d>: Abbrev Number: 32 (DW_TAG_base_type)
    <a9e>   DW_AT_byte_size   : 4
    <a9f>   DW_AT_encoding    : 5	(signed)
    <aa0>   DW_AT_name        : int
 <1><aa4>: Abbrev Number: 8 (DW_TAG_base_type)
    <aa5>   DW_AT_byte_size   : 4
    <aa6>   DW_AT_encoding    : 7	(unsigned)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x48a78): unsigned int
 <1><aab>: Abbrev Number: 8 (DW_TAG_base_type)
    <aac>   DW_AT_byte_size   : 8
    <aad>   DW_AT_encoding    : 5	(signed)
    <aae>   DW_AT_name        : (indirect string, offset: 0x35a2d): long long int
 <1><ab2>: Abbrev Number: 8 (DW_TAG_base_type)
    <ab3>   DW_AT_byte_size   : 8
    <ab4>   DW_AT_encoding    : 4	(float)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x8e4fd): long double
 <1><ab9>: Abbrev Number: 8 (DW_TAG_base_type)
    <aba>   DW_AT_byte_size   : 1
    <abb>   DW_AT_encoding    : 6	(signed char)
    <abc>   DW_AT_name        : (indirect string, offset: 0x64fcd): signed char
 <1><ac0>: Abbrev Number: 5 (DW_TAG_typedef)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x8314): __uint8_t
    <ac5>   DW_AT_decl_file   : 2
    <ac6>   DW_AT_decl_line   : 43
    <ac7>   DW_AT_decl_column : 24
    <ac8>   DW_AT_type        : <0xacc>
 <1><acc>: Abbrev Number: 8 (DW_TAG_base_type)
    <acd>   DW_AT_byte_size   : 1
    <ace>   DW_AT_encoding    : 8	(unsigned char)
    <acf>   DW_AT_name        : (indirect string, offset: 0x6122a): unsigned char
 <1><ad3>: Abbrev Number: 8 (DW_TAG_base_type)
    <ad4>   DW_AT_byte_size   : 2
    <ad5>   DW_AT_encoding    : 5	(signed)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x63ff7): short int
 <1><ada>: Abbrev Number: 5 (DW_TAG_typedef)
    <adb>   DW_AT_name        : (indirect string, offset: 0x6ce5f): __uint16_t
    <adf>   DW_AT_decl_file   : 2
    <ae0>   DW_AT_decl_line   : 57
    <ae1>   DW_AT_decl_column : 25
    <ae2>   DW_AT_type        : <0xae6>
 <1><ae6>: Abbrev Number: 8 (DW_TAG_base_type)
    <ae7>   DW_AT_byte_size   : 2
    <ae8>   DW_AT_encoding    : 7	(unsigned)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x43909): short unsigned int
 <1><aed>: Abbrev Number: 8 (DW_TAG_base_type)
    <aee>   DW_AT_byte_size   : 4
    <aef>   DW_AT_encoding    : 5	(signed)
    <af0>   DW_AT_name        : (indirect string, offset: 0x1ad65): long int
 <1><af4>: Abbrev Number: 5 (DW_TAG_typedef)
    <af5>   DW_AT_name        : (indirect string, offset: 0x3b23c): __uint32_t
    <af9>   DW_AT_decl_file   : 2
    <afa>   DW_AT_decl_line   : 79
    <afb>   DW_AT_decl_column : 25
    <afc>   DW_AT_type        : <0xb00>
 <1><b00>: Abbrev Number: 8 (DW_TAG_base_type)
    <b01>   DW_AT_byte_size   : 4
    <b02>   DW_AT_encoding    : 7	(unsigned)
    <b03>   DW_AT_name        : (indirect string, offset: 0x4f370): long unsigned int
 <1><b07>: Abbrev Number: 8 (DW_TAG_base_type)
    <b08>   DW_AT_byte_size   : 8
    <b09>   DW_AT_encoding    : 7	(unsigned)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x2e0bb): long long unsigned int
 <1><b0e>: Abbrev Number: 5 (DW_TAG_typedef)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x8316): uint8_t
    <b13>   DW_AT_decl_file   : 3
    <b14>   DW_AT_decl_line   : 24
    <b15>   DW_AT_decl_column : 19
    <b16>   DW_AT_type        : <0xac0>
 <1><b1a>: Abbrev Number: 26 (DW_TAG_const_type)
    <b1b>   DW_AT_type        : <0xb0e>
 <1><b1f>: Abbrev Number: 5 (DW_TAG_typedef)
    <b20>   DW_AT_name        : (indirect string, offset: 0x8d6ab): uint16_t
    <b24>   DW_AT_decl_file   : 3
    <b25>   DW_AT_decl_line   : 36
    <b26>   DW_AT_decl_column : 20
    <b27>   DW_AT_type        : <0xada>
 <1><b2b>: Abbrev Number: 19 (DW_TAG_volatile_type)
    <b2c>   DW_AT_type        : <0xb1f>
 <1><b30>: Abbrev Number: 5 (DW_TAG_typedef)
    <b31>   DW_AT_name        : (indirect string, offset: 0x8d68b): uint32_t
    <b35>   DW_AT_decl_file   : 3
    <b36>   DW_AT_decl_line   : 48
    <b37>   DW_AT_decl_column : 20
    <b38>   DW_AT_type        : <0xaf4>
 <1><b3c>: Abbrev Number: 19 (DW_TAG_volatile_type)
    <b3d>   DW_AT_type        : <0xb30>
 <1><b41>: Abbrev Number: 33 (DW_TAG_pointer_type)
    <b42>   DW_AT_byte_size   : 4
 <1><b43>: Abbrev Number: 5 (DW_TAG_typedef)
    <b44>   DW_AT_name        : (indirect string, offset: 0x8d6fb): StackType_t
    <b48>   DW_AT_decl_file   : 4
    <b49>   DW_AT_decl_line   : 55
    <b4a>   DW_AT_decl_column : 24
    <b4b>   DW_AT_type        : <0xb30>
 <1><b4f>: Abbrev Number: 5 (DW_TAG_typedef)
    <b50>   DW_AT_name        : (indirect string, offset: 0x8fab3): UBaseType_t
    <b54>   DW_AT_decl_file   : 4
    <b55>   DW_AT_decl_line   : 57
    <b56>   DW_AT_decl_column : 23
    <b57>   DW_AT_type        : <0xb00>
 <1><b5b>: Abbrev Number: 5 (DW_TAG_typedef)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x8b9dc): TickType_t
    <b60>   DW_AT_decl_file   : 4
    <b61>   DW_AT_decl_line   : 63
    <b62>   DW_AT_decl_column : 19
    <b63>   DW_AT_type        : <0xb30>
 <1><b67>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b68>   DW_AT_byte_size   : 4
    <b68>   DW_AT_type        : <0xb0e>
 <1><b6c>: Abbrev Number: 15 (DW_TAG_typedef)
    <b6d>   DW_AT_name        : (indirect string, offset: 0x8d7ee): wint_t
    <b71>   DW_AT_decl_file   : 5
    <b72>   DW_AT_decl_line   : 350
    <b74>   DW_AT_decl_column : 23
    <b75>   DW_AT_type        : <0xaa4>
 <1><b79>: Abbrev Number: 5 (DW_TAG_typedef)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x8f6ee): _off_t
    <b7e>   DW_AT_decl_file   : 6
    <b7f>   DW_AT_decl_line   : 46
    <b80>   DW_AT_decl_column : 14
    <b81>   DW_AT_type        : <0xaed>
 <1><b85>: Abbrev Number: 5 (DW_TAG_typedef)
    <b86>   DW_AT_name        : (indirect string, offset: 0x88ada): _fpos_t
    <b8a>   DW_AT_decl_file   : 6
    <b8b>   DW_AT_decl_line   : 116
    <b8c>   DW_AT_decl_column : 14
    <b8d>   DW_AT_type        : <0xaed>
 <1><b91>: Abbrev Number: 34 (DW_TAG_union_type)
    <b92>   DW_AT_byte_size   : 4
    <b93>   DW_AT_decl_file   : 6
    <b94>   DW_AT_decl_line   : 165
    <b95>   DW_AT_decl_column : 3
    <b96>   DW_AT_sibling     : <0xbb1>
 <2><b9a>: Abbrev Number: 29 (DW_TAG_member)
    <b9b>   DW_AT_name        : (indirect string, offset: 0x8dc5e): __wch
    <b9f>   DW_AT_decl_file   : 6
    <b9f>   DW_AT_decl_line   : 167
    <ba0>   DW_AT_decl_column : 12
    <ba1>   DW_AT_type        : <0xb6c>
 <2><ba5>: Abbrev Number: 29 (DW_TAG_member)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x8b3b6): __wchb
    <baa>   DW_AT_decl_file   : 6
    <baa>   DW_AT_decl_line   : 168
    <bab>   DW_AT_decl_column : 19
    <bac>   DW_AT_type        : <0xbb1>
 <2><bb0>: Abbrev Number: 0
 <1><bb1>: Abbrev Number: 9 (DW_TAG_array_type)
    <bb2>   DW_AT_type        : <0xacc>
    <bb6>   DW_AT_sibling     : <0xbc1>
 <2><bba>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <bbb>   DW_AT_type        : <0xaa4>
    <bbf>   DW_AT_upper_bound : 3
 <2><bc0>: Abbrev Number: 0
 <1><bc1>: Abbrev Number: 21 (DW_TAG_structure_type)
    <bc2>   DW_AT_byte_size   : 8
    <bc3>   DW_AT_decl_file   : 6
    <bc4>   DW_AT_decl_line   : 162
    <bc5>   DW_AT_decl_column : 9
    <bc5>   DW_AT_sibling     : <0xbe4>
 <2><bc9>: Abbrev Number: 1 (DW_TAG_member)
    <bca>   DW_AT_name        : (indirect string, offset: 0x891d2): __count
    <bce>   DW_AT_decl_file   : 6
    <bcf>   DW_AT_decl_line   : 164
    <bd0>   DW_AT_decl_column : 7
    <bd1>   DW_AT_type        : <0xa9d>
    <bd5>   DW_AT_data_member_location: 0
 <2><bd6>: Abbrev Number: 1 (DW_TAG_member)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x8bcbd): __value
    <bdb>   DW_AT_decl_file   : 6
    <bdc>   DW_AT_decl_line   : 169
    <bdd>   DW_AT_decl_column : 5
    <bde>   DW_AT_type        : <0xb91>
    <be2>   DW_AT_data_member_location: 4
 <2><be3>: Abbrev Number: 0
 <1><be4>: Abbrev Number: 5 (DW_TAG_typedef)
    <be5>   DW_AT_name        : (indirect string, offset: 0x8b57b): _mbstate_t
    <be9>   DW_AT_decl_file   : 6
    <bea>   DW_AT_decl_line   : 170
    <beb>   DW_AT_decl_column : 3
    <bec>   DW_AT_type        : <0xbc1>
 <1><bf0>: Abbrev Number: 5 (DW_TAG_typedef)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x8b7a8): __ULong
    <bf5>   DW_AT_decl_file   : 7
    <bf6>   DW_AT_decl_line   : 22
    <bf7>   DW_AT_decl_column : 25
    <bf8>   DW_AT_type        : <0xb00>
 <1><bfc>: Abbrev Number: 5 (DW_TAG_typedef)
    <bfd>   DW_AT_name        : (indirect string, offset: 0x8b957): _LOCK_T
    <c01>   DW_AT_decl_file   : 8
    <c02>   DW_AT_decl_line   : 34
    <c03>   DW_AT_decl_column : 25
    <c04>   DW_AT_type        : <0xc08>
 <1><c08>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c09>   DW_AT_byte_size   : 4
    <c09>   DW_AT_type        : <0xc0d>
 <1><c0d>: Abbrev Number: 27 (DW_TAG_structure_type)
    <c0e>   DW_AT_name        : (indirect string, offset: 0x896be): __lock
    <c12>   DW_AT_declaration : 1
 <1><c12>: Abbrev Number: 5 (DW_TAG_typedef)
    <c13>   DW_AT_name        : (indirect string, offset: 0x8b13f): _flock_t
    <c17>   DW_AT_decl_file   : 7
    <c18>   DW_AT_decl_line   : 35
    <c19>   DW_AT_decl_column : 27
    <c1a>   DW_AT_type        : <0xbfc>
 <1><c1e>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x899f0): _Bigint
    <c23>   DW_AT_byte_size   : 24
    <c24>   DW_AT_decl_file   : 7
    <c25>   DW_AT_decl_line   : 52
    <c26>   DW_AT_decl_column : 8
    <c27>   DW_AT_sibling     : <0xc78>
 <2><c2b>: Abbrev Number: 1 (DW_TAG_member)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x8bf39): _next
    <c30>   DW_AT_decl_file   : 7
    <c31>   DW_AT_decl_line   : 54
    <c32>   DW_AT_decl_column : 19
    <c33>   DW_AT_type        : <0xc78>
    <c37>   DW_AT_data_member_location: 0
 <2><c38>: Abbrev Number: 7 (DW_TAG_member)
    <c39>   DW_AT_name        : _k
    <c3c>   DW_AT_decl_file   : 7
    <c3d>   DW_AT_decl_line   : 55
    <c3e>   DW_AT_decl_column : 7
    <c3f>   DW_AT_type        : <0xa9d>
    <c43>   DW_AT_data_member_location: 4
 <2><c44>: Abbrev Number: 1 (DW_TAG_member)
    <c45>   DW_AT_name        : (indirect string, offset: 0x8d591): _maxwds
    <c49>   DW_AT_decl_file   : 7
    <c4a>   DW_AT_decl_line   : 55
    <c4b>   DW_AT_decl_column : 11
    <c4c>   DW_AT_type        : <0xa9d>
    <c50>   DW_AT_data_member_location: 8
 <2><c51>: Abbrev Number: 1 (DW_TAG_member)
    <c52>   DW_AT_name        : (indirect string, offset: 0x8b629): _sign
    <c56>   DW_AT_decl_file   : 7
    <c57>   DW_AT_decl_line   : 55
    <c58>   DW_AT_decl_column : 20
    <c59>   DW_AT_type        : <0xa9d>
    <c5d>   DW_AT_data_member_location: 12
 <2><c5e>: Abbrev Number: 1 (DW_TAG_member)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x8b624): _wds
    <c63>   DW_AT_decl_file   : 7
    <c64>   DW_AT_decl_line   : 55
    <c65>   DW_AT_decl_column : 27
    <c66>   DW_AT_type        : <0xa9d>
    <c6a>   DW_AT_data_member_location: 16
 <2><c6b>: Abbrev Number: 7 (DW_TAG_member)
    <c6c>   DW_AT_name        : _x
    <c6f>   DW_AT_decl_file   : 7
    <c70>   DW_AT_decl_line   : 56
    <c71>   DW_AT_decl_column : 11
    <c72>   DW_AT_type        : <0xc7d>
    <c76>   DW_AT_data_member_location: 20
 <2><c77>: Abbrev Number: 0
 <1><c78>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c79>   DW_AT_byte_size   : 4
    <c79>   DW_AT_type        : <0xc1e>
 <1><c7d>: Abbrev Number: 9 (DW_TAG_array_type)
    <c7e>   DW_AT_type        : <0xbf0>
    <c82>   DW_AT_sibling     : <0xc8d>
 <2><c86>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c87>   DW_AT_type        : <0xaa4>
    <c8b>   DW_AT_upper_bound : 0
 <2><c8c>: Abbrev Number: 0
 <1><c8d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x89069): __tm
    <c92>   DW_AT_byte_size   : 36
    <c93>   DW_AT_decl_file   : 7
    <c94>   DW_AT_decl_line   : 60
    <c95>   DW_AT_decl_column : 8
    <c96>   DW_AT_sibling     : <0xd10>
 <2><c9a>: Abbrev Number: 1 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x8e4d5): __tm_sec
    <c9f>   DW_AT_decl_file   : 7
    <ca0>   DW_AT_decl_line   : 62
    <ca1>   DW_AT_decl_column : 9
    <ca2>   DW_AT_type        : <0xa9d>
    <ca6>   DW_AT_data_member_location: 0
 <2><ca7>: Abbrev Number: 1 (DW_TAG_member)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x86901): __tm_min
    <cac>   DW_AT_decl_file   : 7
    <cad>   DW_AT_decl_line   : 63
    <cae>   DW_AT_decl_column : 9
    <caf>   DW_AT_type        : <0xa9d>
    <cb3>   DW_AT_data_member_location: 4
 <2><cb4>: Abbrev Number: 1 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x88973): __tm_hour
    <cb9>   DW_AT_decl_file   : 7
    <cba>   DW_AT_decl_line   : 64
    <cbb>   DW_AT_decl_column : 9
    <cbc>   DW_AT_type        : <0xa9d>
    <cc0>   DW_AT_data_member_location: 8
 <2><cc1>: Abbrev Number: 1 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x8bef6): __tm_mday
    <cc6>   DW_AT_decl_file   : 7
    <cc7>   DW_AT_decl_line   : 65
    <cc8>   DW_AT_decl_column : 9
    <cc9>   DW_AT_type        : <0xa9d>
    <ccd>   DW_AT_data_member_location: 12
 <2><cce>: Abbrev Number: 1 (DW_TAG_member)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x86b0b): __tm_mon
    <cd3>   DW_AT_decl_file   : 7
    <cd4>   DW_AT_decl_line   : 66
    <cd5>   DW_AT_decl_column : 9
    <cd6>   DW_AT_type        : <0xa9d>
    <cda>   DW_AT_data_member_location: 16
 <2><cdb>: Abbrev Number: 1 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x8fc06): __tm_year
    <ce0>   DW_AT_decl_file   : 7
    <ce1>   DW_AT_decl_line   : 67
    <ce2>   DW_AT_decl_column : 9
    <ce3>   DW_AT_type        : <0xa9d>
    <ce7>   DW_AT_data_member_location: 20
 <2><ce8>: Abbrev Number: 1 (DW_TAG_member)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x8a62c): __tm_wday
    <ced>   DW_AT_decl_file   : 7
    <cee>   DW_AT_decl_line   : 68
    <cef>   DW_AT_decl_column : 9
    <cf0>   DW_AT_type        : <0xa9d>
    <cf4>   DW_AT_data_member_location: 24
 <2><cf5>: Abbrev Number: 1 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x8e0d3): __tm_yday
    <cfa>   DW_AT_decl_file   : 7
    <cfb>   DW_AT_decl_line   : 69
    <cfc>   DW_AT_decl_column : 9
    <cfd>   DW_AT_type        : <0xa9d>
    <d01>   DW_AT_data_member_location: 28
 <2><d02>: Abbrev Number: 1 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0x8f2d2): __tm_isdst
    <d07>   DW_AT_decl_file   : 7
    <d08>   DW_AT_decl_line   : 70
    <d09>   DW_AT_decl_column : 9
    <d0a>   DW_AT_type        : <0xa9d>
    <d0e>   DW_AT_data_member_location: 32
 <2><d0f>: Abbrev Number: 0
 <1><d10>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d11>   DW_AT_name        : (indirect string, offset: 0x8cb8e): __sbuf
    <d15>   DW_AT_byte_size   : 8
    <d16>   DW_AT_decl_file   : 7
    <d17>   DW_AT_decl_line   : 115
    <d18>   DW_AT_decl_column : 8
    <d19>   DW_AT_sibling     : <0xd38>
 <2><d1d>: Abbrev Number: 1 (DW_TAG_member)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x90770): _base
    <d22>   DW_AT_decl_file   : 7
    <d23>   DW_AT_decl_line   : 116
    <d24>   DW_AT_decl_column : 17
    <d25>   DW_AT_type        : <0xd38>
    <d29>   DW_AT_data_member_location: 0
 <2><d2a>: Abbrev Number: 1 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x8bc7c): _size
    <d2f>   DW_AT_decl_file   : 7
    <d30>   DW_AT_decl_line   : 117
    <d31>   DW_AT_decl_column : 6
    <d32>   DW_AT_type        : <0xa9d>
    <d36>   DW_AT_data_member_location: 4
 <2><d37>: Abbrev Number: 0
 <1><d38>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d39>   DW_AT_byte_size   : 4
    <d39>   DW_AT_type        : <0xacc>
 <1><d3d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x8db85): __sFILE
    <d42>   DW_AT_byte_size   : 104
    <d43>   DW_AT_decl_file   : 7
    <d44>   DW_AT_decl_line   : 147
    <d45>   DW_AT_decl_column : 8
    <d46>   DW_AT_sibling     : <0xe80>
 <2><d4a>: Abbrev Number: 7 (DW_TAG_member)
    <d4b>   DW_AT_name        : _p
    <d4e>   DW_AT_decl_file   : 7
    <d4f>   DW_AT_decl_line   : 148
    <d50>   DW_AT_decl_column : 18
    <d51>   DW_AT_type        : <0xd38>
    <d55>   DW_AT_data_member_location: 0
 <2><d56>: Abbrev Number: 7 (DW_TAG_member)
    <d57>   DW_AT_name        : _r
    <d5a>   DW_AT_decl_file   : 7
    <d5b>   DW_AT_decl_line   : 149
    <d5c>   DW_AT_decl_column : 7
    <d5d>   DW_AT_type        : <0xa9d>
    <d61>   DW_AT_data_member_location: 4
 <2><d62>: Abbrev Number: 7 (DW_TAG_member)
    <d63>   DW_AT_name        : _w
    <d66>   DW_AT_decl_file   : 7
    <d67>   DW_AT_decl_line   : 150
    <d68>   DW_AT_decl_column : 7
    <d69>   DW_AT_type        : <0xa9d>
    <d6d>   DW_AT_data_member_location: 8
 <2><d6e>: Abbrev Number: 1 (DW_TAG_member)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x8aae1): _flags
    <d73>   DW_AT_decl_file   : 7
    <d74>   DW_AT_decl_line   : 151
    <d75>   DW_AT_decl_column : 9
    <d76>   DW_AT_type        : <0xad3>
    <d7a>   DW_AT_data_member_location: 12
 <2><d7b>: Abbrev Number: 1 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x88065): _file
    <d80>   DW_AT_decl_file   : 7
    <d81>   DW_AT_decl_line   : 152
    <d82>   DW_AT_decl_column : 9
    <d83>   DW_AT_type        : <0xad3>
    <d87>   DW_AT_data_member_location: 14
 <2><d88>: Abbrev Number: 7 (DW_TAG_member)
    <d89>   DW_AT_name        : _bf
    <d8d>   DW_AT_decl_file   : 7
    <d8e>   DW_AT_decl_line   : 153
    <d8f>   DW_AT_decl_column : 17
    <d90>   DW_AT_type        : <0xd10>
    <d94>   DW_AT_data_member_location: 16
 <2><d95>: Abbrev Number: 1 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0x8ab4b): _lbfsize
    <d9a>   DW_AT_decl_file   : 7
    <d9b>   DW_AT_decl_line   : 154
    <d9c>   DW_AT_decl_column : 7
    <d9d>   DW_AT_type        : <0xa9d>
    <da1>   DW_AT_data_member_location: 24
 <2><da2>: Abbrev Number: 1 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0x93a1b): _data
    <da7>   DW_AT_decl_file   : 7
    <da8>   DW_AT_decl_line   : 157
    <da9>   DW_AT_decl_column : 18
    <daa>   DW_AT_type        : <0xf99>
    <dae>   DW_AT_data_member_location: 28
 <2><daf>: Abbrev Number: 1 (DW_TAG_member)
    <db0>   DW_AT_name        : (indirect string, offset: 0x8f215): _cookie
    <db4>   DW_AT_decl_file   : 7
    <db5>   DW_AT_decl_line   : 161
    <db6>   DW_AT_decl_column : 10
    <db7>   DW_AT_type        : <0xb41>
    <dbb>   DW_AT_data_member_location: 32
 <2><dbc>: Abbrev Number: 1 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x8df53): _read
    <dc1>   DW_AT_decl_file   : 7
    <dc2>   DW_AT_decl_line   : 163
    <dc3>   DW_AT_decl_column : 29
    <dc4>   DW_AT_type        : <0xfcd>
    <dc8>   DW_AT_data_member_location: 36
 <2><dc9>: Abbrev Number: 1 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0x87c76): _write
    <dce>   DW_AT_decl_file   : 7
    <dcf>   DW_AT_decl_line   : 165
    <dd0>   DW_AT_decl_column : 29
    <dd1>   DW_AT_type        : <0xff5>
    <dd5>   DW_AT_data_member_location: 40
 <2><dd6>: Abbrev Number: 1 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x903f0): _seek
    <ddb>   DW_AT_decl_file   : 7
    <ddc>   DW_AT_decl_line   : 168
    <ddd>   DW_AT_decl_column : 13
    <dde>   DW_AT_type        : <0x1018>
    <de2>   DW_AT_data_member_location: 44
 <2><de3>: Abbrev Number: 1 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0x8a984): _close
    <de8>   DW_AT_decl_file   : 7
    <de9>   DW_AT_decl_line   : 169
    <dea>   DW_AT_decl_column : 9
    <deb>   DW_AT_type        : <0x1031>
    <def>   DW_AT_data_member_location: 48
 <2><df0>: Abbrev Number: 7 (DW_TAG_member)
    <df1>   DW_AT_name        : _ub
    <df5>   DW_AT_decl_file   : 7
    <df6>   DW_AT_decl_line   : 172
    <df7>   DW_AT_decl_column : 17
    <df8>   DW_AT_type        : <0xd10>
    <dfc>   DW_AT_data_member_location: 52
 <2><dfd>: Abbrev Number: 7 (DW_TAG_member)
    <dfe>   DW_AT_name        : _up
    <e02>   DW_AT_decl_file   : 7
    <e03>   DW_AT_decl_line   : 173
    <e04>   DW_AT_decl_column : 18
    <e05>   DW_AT_type        : <0xd38>
    <e09>   DW_AT_data_member_location: 60
 <2><e0a>: Abbrev Number: 7 (DW_TAG_member)
    <e0b>   DW_AT_name        : _ur
    <e0f>   DW_AT_decl_file   : 7
    <e10>   DW_AT_decl_line   : 174
    <e11>   DW_AT_decl_column : 7
    <e12>   DW_AT_type        : <0xa9d>
    <e16>   DW_AT_data_member_location: 64
 <2><e17>: Abbrev Number: 1 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0x89063): _ubuf
    <e1c>   DW_AT_decl_file   : 7
    <e1d>   DW_AT_decl_line   : 177
    <e1e>   DW_AT_decl_column : 17
    <e1f>   DW_AT_type        : <0x1036>
    <e23>   DW_AT_data_member_location: 68
 <2><e24>: Abbrev Number: 1 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x8cca4): _nbuf
    <e29>   DW_AT_decl_file   : 7
    <e2a>   DW_AT_decl_line   : 178
    <e2b>   DW_AT_decl_column : 17
    <e2c>   DW_AT_type        : <0x1046>
    <e30>   DW_AT_data_member_location: 71
 <2><e31>: Abbrev Number: 7 (DW_TAG_member)
    <e32>   DW_AT_name        : _lb
    <e36>   DW_AT_decl_file   : 7
    <e37>   DW_AT_decl_line   : 181
    <e38>   DW_AT_decl_column : 17
    <e39>   DW_AT_type        : <0xd10>
    <e3d>   DW_AT_data_member_location: 72
 <2><e3e>: Abbrev Number: 1 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x88eb1): _blksize
    <e43>   DW_AT_decl_file   : 7
    <e44>   DW_AT_decl_line   : 184
    <e45>   DW_AT_decl_column : 7
    <e46>   DW_AT_type        : <0xa9d>
    <e4a>   DW_AT_data_member_location: 80
 <2><e4b>: Abbrev Number: 1 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x89760): _offset
    <e50>   DW_AT_decl_file   : 7
    <e51>   DW_AT_decl_line   : 185
    <e52>   DW_AT_decl_column : 10
    <e53>   DW_AT_type        : <0xb79>
    <e57>   DW_AT_data_member_location: 84
 <2><e58>: Abbrev Number: 1 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x896bf): _lock
    <e5d>   DW_AT_decl_file   : 7
    <e5e>   DW_AT_decl_line   : 192
    <e5f>   DW_AT_decl_column : 12
    <e60>   DW_AT_type        : <0xc12>
    <e64>   DW_AT_data_member_location: 88
 <2><e65>: Abbrev Number: 1 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x87b01): _mbstate
    <e6a>   DW_AT_decl_file   : 7
    <e6b>   DW_AT_decl_line   : 194
    <e6c>   DW_AT_decl_column : 14
    <e6d>   DW_AT_type        : <0xbe4>
    <e71>   DW_AT_data_member_location: 92
 <2><e72>: Abbrev Number: 1 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x8e46e): _flags2
    <e77>   DW_AT_decl_file   : 7
    <e78>   DW_AT_decl_line   : 195
    <e79>   DW_AT_decl_column : 9
    <e7a>   DW_AT_type        : <0xa9d>
    <e7e>   DW_AT_data_member_location: 100
 <2><e7f>: Abbrev Number: 0
 <1><e80>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e81>   DW_AT_name        : (indirect string, offset: 0x95ad9): _reent
    <e85>   DW_AT_byte_size   : 76
    <e86>   DW_AT_decl_file   : 7
    <e87>   DW_AT_decl_line   : 359
    <e89>   DW_AT_decl_column : 8
    <e8a>   DW_AT_sibling     : <0xf99>
 <2><e8e>: Abbrev Number: 2 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x8bf00): _errno
    <e93>   DW_AT_decl_file   : 7
    <e94>   DW_AT_decl_line   : 363
    <e96>   DW_AT_decl_column : 7
    <e97>   DW_AT_type        : <0xa9d>
    <e9b>   DW_AT_data_member_location: 0
 <2><e9c>: Abbrev Number: 2 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x8b26a): _stdin
    <ea1>   DW_AT_decl_file   : 7
    <ea2>   DW_AT_decl_line   : 368
    <ea4>   DW_AT_decl_column : 11
    <ea5>   DW_AT_type        : <0x1062>
    <ea9>   DW_AT_data_member_location: 4
 <2><eaa>: Abbrev Number: 2 (DW_TAG_member)
    <eab>   DW_AT_name        : (indirect string, offset: 0x8ce3b): _stdout
    <eaf>   DW_AT_decl_file   : 7
    <eb0>   DW_AT_decl_line   : 368
    <eb2>   DW_AT_decl_column : 20
    <eb3>   DW_AT_type        : <0x1062>
    <eb7>   DW_AT_data_member_location: 8
 <2><eb8>: Abbrev Number: 2 (DW_TAG_member)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x8f839): _stderr
    <ebd>   DW_AT_decl_file   : 7
    <ebe>   DW_AT_decl_line   : 368
    <ec0>   DW_AT_decl_column : 30
    <ec1>   DW_AT_type        : <0x1062>
    <ec5>   DW_AT_data_member_location: 12
 <2><ec6>: Abbrev Number: 2 (DW_TAG_member)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x8c6c5): _inc
    <ecb>   DW_AT_decl_file   : 7
    <ecc>   DW_AT_decl_line   : 370
    <ece>   DW_AT_decl_column : 8
    <ecf>   DW_AT_type        : <0xa9d>
    <ed3>   DW_AT_data_member_location: 16
 <2><ed4>: Abbrev Number: 2 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x8e02a): _emergency
    <ed9>   DW_AT_decl_file   : 7
    <eda>   DW_AT_decl_line   : 372
    <edc>   DW_AT_decl_column : 9
    <edd>   DW_AT_type        : <0xfbc>
    <ee1>   DW_AT_data_member_location: 20
 <2><ee2>: Abbrev Number: 2 (DW_TAG_member)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x8f0d6): _locale
    <ee7>   DW_AT_decl_file   : 7
    <ee8>   DW_AT_decl_line   : 378
    <eea>   DW_AT_decl_column : 22
    <eeb>   DW_AT_type        : <0x11c8>
    <eef>   DW_AT_data_member_location: 24
 <2><ef0>: Abbrev Number: 12 (DW_TAG_member)
    <ef1>   DW_AT_name        : _mp
    <ef5>   DW_AT_decl_file   : 7
    <ef6>   DW_AT_decl_line   : 380
    <ef8>   DW_AT_decl_column : 18
    <ef9>   DW_AT_type        : <0x11cd>
    <efd>   DW_AT_data_member_location: 28
 <2><efe>: Abbrev Number: 2 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0x8806b): __cleanup
    <f03>   DW_AT_decl_file   : 7
    <f04>   DW_AT_decl_line   : 382
    <f06>   DW_AT_decl_column : 10
    <f07>   DW_AT_type        : <0x11dd>
    <f0b>   DW_AT_data_member_location: 32
 <2><f0c>: Abbrev Number: 2 (DW_TAG_member)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x8748b): _gamma_signgam
    <f11>   DW_AT_decl_file   : 7
    <f12>   DW_AT_decl_line   : 384
    <f14>   DW_AT_decl_column : 7
    <f15>   DW_AT_type        : <0xa9d>
    <f19>   DW_AT_data_member_location: 36
 <2><f1a>: Abbrev Number: 2 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x8d7df): _cvtlen
    <f1f>   DW_AT_decl_file   : 7
    <f20>   DW_AT_decl_line   : 387
    <f22>   DW_AT_decl_column : 7
    <f23>   DW_AT_type        : <0xa9d>
    <f27>   DW_AT_data_member_location: 40
 <2><f28>: Abbrev Number: 2 (DW_TAG_member)
    <f29>   DW_AT_name        : (indirect string, offset: 0x8abab): _cvtbuf
    <f2d>   DW_AT_decl_file   : 7
    <f2e>   DW_AT_decl_line   : 388
    <f30>   DW_AT_decl_column : 9
    <f31>   DW_AT_type        : <0xfbc>
    <f35>   DW_AT_data_member_location: 44
 <2><f36>: Abbrev Number: 2 (DW_TAG_member)
    <f37>   DW_AT_name        : (indirect string, offset: 0x8d8fc): _r48
    <f3b>   DW_AT_decl_file   : 7
    <f3c>   DW_AT_decl_line   : 390
    <f3e>   DW_AT_decl_column : 19
    <f3f>   DW_AT_type        : <0x11e2>
    <f43>   DW_AT_data_member_location: 48
 <2><f44>: Abbrev Number: 2 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0x8e6f2): _localtime_buf
    <f49>   DW_AT_decl_file   : 7
    <f4a>   DW_AT_decl_line   : 391
    <f4c>   DW_AT_decl_column : 16
    <f4d>   DW_AT_type        : <0x11e7>
    <f51>   DW_AT_data_member_location: 52
 <2><f52>: Abbrev Number: 2 (DW_TAG_member)
    <f53>   DW_AT_name        : (indirect string, offset: 0x88da6): _asctime_buf
    <f57>   DW_AT_decl_file   : 7
    <f58>   DW_AT_decl_line   : 392
    <f5a>   DW_AT_decl_column : 9
    <f5b>   DW_AT_type        : <0xfbc>
    <f5f>   DW_AT_data_member_location: 56
 <2><f60>: Abbrev Number: 2 (DW_TAG_member)
    <f61>   DW_AT_name        : (indirect string, offset: 0x87108): _sig_func
    <f65>   DW_AT_decl_file   : 7
    <f66>   DW_AT_decl_line   : 395
    <f68>   DW_AT_decl_column : 12
    <f69>   DW_AT_type        : <0x11f7>
    <f6d>   DW_AT_data_member_location: 60
 <2><f6e>: Abbrev Number: 2 (DW_TAG_member)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x8905e): __sf
    <f73>   DW_AT_decl_file   : 7
    <f74>   DW_AT_decl_line   : 403
    <f76>   DW_AT_decl_column : 11
    <f77>   DW_AT_type        : <0x1062>
    <f7b>   DW_AT_data_member_location: 64
 <2><f7c>: Abbrev Number: 2 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x8aa8c): _misc
    <f81>   DW_AT_decl_file   : 7
    <f82>   DW_AT_decl_line   : 404
    <f84>   DW_AT_decl_column : 23
    <f85>   DW_AT_type        : <0x1201>
    <f89>   DW_AT_data_member_location: 68
 <2><f8a>: Abbrev Number: 2 (DW_TAG_member)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x8c52a): _signal_buf
    <f8f>   DW_AT_decl_file   : 7
    <f90>   DW_AT_decl_line   : 405
    <f92>   DW_AT_decl_column : 9
    <f93>   DW_AT_type        : <0xfbc>
    <f97>   DW_AT_data_member_location: 72
 <2><f98>: Abbrev Number: 0
 <1><f99>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f9a>   DW_AT_byte_size   : 4
    <f9a>   DW_AT_type        : <0xe80>
 <1><f9e>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <f9f>   DW_AT_prototyped  : 1
    <f9f>   DW_AT_type        : <0xa9d>
    <fa3>   DW_AT_sibling     : <0xfbc>
 <2><fa7>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fa8>   DW_AT_type        : <0xf99>
 <2><fac>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fad>   DW_AT_type        : <0xb41>
 <2><fb1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fb2>   DW_AT_type        : <0xfbc>
 <2><fb6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fb7>   DW_AT_type        : <0xa9d>
 <2><fbb>: Abbrev Number: 0
 <1><fbc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fbd>   DW_AT_byte_size   : 4
    <fbd>   DW_AT_type        : <0xfc1>
 <1><fc1>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc2>   DW_AT_byte_size   : 1
    <fc3>   DW_AT_encoding    : 8	(unsigned char)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x897e5): char
 <1><fc8>: Abbrev Number: 26 (DW_TAG_const_type)
    <fc9>   DW_AT_type        : <0xfc1>
 <1><fcd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fce>   DW_AT_byte_size   : 4
    <fce>   DW_AT_type        : <0xf9e>
 <1><fd2>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <fd3>   DW_AT_prototyped  : 1
    <fd3>   DW_AT_type        : <0xa9d>
    <fd7>   DW_AT_sibling     : <0xff0>
 <2><fdb>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fdc>   DW_AT_type        : <0xf99>
 <2><fe0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fe1>   DW_AT_type        : <0xb41>
 <2><fe5>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fe6>   DW_AT_type        : <0xff0>
 <2><fea>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <feb>   DW_AT_type        : <0xa9d>
 <2><fef>: Abbrev Number: 0
 <1><ff0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ff1>   DW_AT_byte_size   : 4
    <ff1>   DW_AT_type        : <0xfc8>
 <1><ff5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ff6>   DW_AT_byte_size   : 4
    <ff6>   DW_AT_type        : <0xfd2>
 <1><ffa>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <ffb>   DW_AT_prototyped  : 1
    <ffb>   DW_AT_type        : <0xb85>
    <fff>   DW_AT_sibling     : <0x1018>
 <2><1003>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1004>   DW_AT_type        : <0xf99>
 <2><1008>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1009>   DW_AT_type        : <0xb41>
 <2><100d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <100e>   DW_AT_type        : <0xb85>
 <2><1012>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1013>   DW_AT_type        : <0xa9d>
 <2><1017>: Abbrev Number: 0
 <1><1018>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <1019>   DW_AT_byte_size   : 4
    <1019>   DW_AT_type        : <0xffa>
 <1><101d>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <101e>   DW_AT_prototyped  : 1
    <101e>   DW_AT_type        : <0xa9d>
    <1022>   DW_AT_sibling     : <0x1031>
 <2><1026>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1027>   DW_AT_type        : <0xf99>
 <2><102b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <102c>   DW_AT_type        : <0xb41>
 <2><1030>: Abbrev Number: 0
 <1><1031>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <1032>   DW_AT_byte_size   : 4
    <1032>   DW_AT_type        : <0x101d>
 <1><1036>: Abbrev Number: 9 (DW_TAG_array_type)
    <1037>   DW_AT_type        : <0xacc>
    <103b>   DW_AT_sibling     : <0x1046>
 <2><103f>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <1040>   DW_AT_type        : <0xaa4>
    <1044>   DW_AT_upper_bound : 2
 <2><1045>: Abbrev Number: 0
 <1><1046>: Abbrev Number: 9 (DW_TAG_array_type)
    <1047>   DW_AT_type        : <0xacc>
    <104b>   DW_AT_sibling     : <0x1056>
 <2><104f>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <1050>   DW_AT_type        : <0xaa4>
    <1054>   DW_AT_upper_bound : 0
 <2><1055>: Abbrev Number: 0
 <1><1056>: Abbrev Number: 5 (DW_TAG_typedef)
    <1057>   DW_AT_name        : (indirect string, offset: 0x8c70d): __FILE
    <105b>   DW_AT_decl_file   : 7
    <105c>   DW_AT_decl_line   : 253
    <105d>   DW_AT_decl_column : 26
    <105e>   DW_AT_type        : <0xd3d>
 <1><1062>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <1063>   DW_AT_byte_size   : 4
    <1063>   DW_AT_type        : <0x1056>
 <1><1067>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1068>   DW_AT_name        : (indirect string, offset: 0x899e8): _rand48
    <106c>   DW_AT_byte_size   : 24
    <106d>   DW_AT_decl_file   : 7
    <106e>   DW_AT_decl_line   : 289
    <1070>   DW_AT_decl_column : 8
    <1071>   DW_AT_sibling     : <0x10ae>
 <2><1075>: Abbrev Number: 2 (DW_TAG_member)
    <1076>   DW_AT_name        : (indirect string, offset: 0x893da): _seed
    <107a>   DW_AT_decl_file   : 7
    <107b>   DW_AT_decl_line   : 290
    <107d>   DW_AT_decl_column : 18
    <107e>   DW_AT_type        : <0x10ae>
    <1082>   DW_AT_data_member_location: 0
 <2><1083>: Abbrev Number: 2 (DW_TAG_member)
    <1084>   DW_AT_name        : (indirect string, offset: 0x8766e): _mult
    <1088>   DW_AT_decl_file   : 7
    <1089>   DW_AT_decl_line   : 291
    <108b>   DW_AT_decl_column : 18
    <108c>   DW_AT_type        : <0x10ae>
